[
 [
  [
   [
    "CD_SW_SSL_SHIM-2-SHIM_INIT_FAILED:QFP Crypto device software library initialization failure result: %d.",
    "Cisco internal software error. QFP Crypto device software library initialization detected critical failure. QFP Crypto device software library will not be functional while this condition exists."
   ],
   1
  ],
  0.6084228157997131
 ],
 [
  [
   [
    "DYNCMD-3-LINKUNKNOWNALTNODE:Link node message received for unknown alternate node '%u'",
    "A message with an invalid field value was received for Dynamic Command creation"
   ],
   0
  ],
  0.707726240158081
 ],
 [
  [
   [
    "FPGA-2-DOWNLOAD:Download Fail FPGA# %d",
    "The specified FPGA chip failed to respond after downloading its control microcode. This is probably caused by a hardware failure. It is a fatal condition for the system and will be followed by a core dump."
   ],
   1
  ],
  0.6674133539199829
 ],
 [
  [
   [
    "CLSDR-3-NOPORTCREATE:Cannot create PORT structure",
    "The CLSDRIVER cannot enable this port for processing."
   ],
   1
  ],
  0.8474968075752258
 ],
 [
  [
   [
    "CHKPT-4-INIT:Checkpoint %s initialization failed in RF state %s",
    "Checkpointing initialization has failed This is software error caused by an out of memory condition as there aren't enough resources available to set up the  initialization data structures"
   ],
   1
  ],
  0.8253417015075684
 ],
 [
  [
   [
    "IF-3-BADLOCK:Invalid lock use for %s: %s%s",
    "Application layer code attempted to access an unlocked interface."
   ],
   1
  ],
  0.6785418391227722
 ],
 [
  [
   [
    "GDOI-3-GM_ACL_PERMIT:GM doesn't support permit configured under local access-list. Traffic from %s to %s will be dropped.",
    "This is a configuration error for dsmib.It indicates that dsmib shim does not get the notification when the policymap is configured on the box through MQC. This also potentially means the dsmib db will be out-of-sync with respect to MQC configurations.Capture the log in the console with policy name for any possible debugging."
   ],
   0
  ],
  0.6906053423881531
 ],
 [
  [
   [
    "IFMGR-4-NOSYNC:ifIndex not being synced between active and standby",
    "When the standby comes up then the tuple of ifIndex and ifDescr is synced so that when interfaces comes up they get the same ifIndex. This error happens when the interface doesn't get the ifIndex for the given ifDescr"
   ],
   1
  ],
  0.5981807708740234
 ],
 [
  [
   [
    "CE3-1-CONFIGURE:Failed to configure %d interfaces in bay %d shutting down bay",
    "An invalid TX accumulator is detected."
   ],
   0
  ],
  0.6983891725540161
 ],
 [
  [
   [
    "FRAG-3-INVALID_QFP_NO:Invalid qfp device no.: %s",
    "The ATM network module hardware may be bad"
   ],
   0
  ],
  0.7538861632347107
 ],
 [
  [
   [
    "AP-1-AUTH_PROXY_DOS_ATTACK:Possible DOS attack from source IP-address %i| AuditSessionID %s",
    "This message indicates that a host is continuously opening HTTP connections through the auth-proxy without sending data on them. This can potentially be a DOS attack."
   ],
   1
  ],
  0.6569608449935913
 ],
 [
  [
   [
    "GTP-3-INCOMPLETECONFIG:\\ APN: %s Reason: %s",
    "A required configuration is missing"
   ],
   1
  ],
  0.7240856885910034
 ],
 [
  [
   [
    "CBAC_C3PL-4-OBJ_MODIFY:Firewall %s object %s modification failed in the data plane error %d",
    "Adjacency and LSP information learned from this interface cannot be checkpointed due to an interface encoding error."
   ],
   0
  ],
  0.6716541051864624
 ],
 [
  [
   [
    "CPPBQS-3-REPARENTFAIL:QFP %d schedule %s reparent failed %#x - SEID=%#X SID=%#x",
    "A QFP BQS schedule reparent operation failed."
   ],
   1
  ],
  0.7300731539726257
 ],
 [
  [
   [
    "CMTS-4-RECONCL_CM_TIMEOUT:Reconciliation for slot %d timeout",
    "Usually the reconciliation will end after all modem info being synced between SUP and LC. If we didn't get the end normally timer mechanism will take job and clean up left modem info"
   ],
   1
  ],
  0.6898775696754456
 ],
 [
  [
   [
    "CTS-3-IFC_CACHE_RESTORE_FAIL:Cache Restoration Failed",
    "An internal software debug info to notify IPCCL session  to specific slot went down."
   ],
   0
  ],
  0.6792686581611633
 ],
 [
  [
   [
    "AN-3-DOMAIN_KEY_GEN_FAIL:The bootstrapping device %s failed to generate key pair for enrollment at ANRA",
    "The key pair generation failed at the device for triggering BS request message to ANRA. Can be due to failure in RSA key pair generation in the crypto library"
   ],
   1
  ],
  0.5126633644104004
 ],
 [
  [
   [
    "IDBMAN-3-AGGPORTMISMATCH:%s: %s%d / %d does match internal slot/port state %s%d / %d",
    "This hardware platform supports filtering based on DSCP rather than TOS and precedence. The DSCP field does not include the minimize monetary cost bit from the TOS field so hardware will ignore this bit when checking for a match to an ACE. This can lead to unintended filtering actions."
   ],
   0
  ],
  0.6446576714515686
 ],
 [
  [
   [
    "CWS-3-IPC_SEND_FAILED:CWS-IPC %s %s send failed %u",
    "Invalid 'Output Buffer Logic' page requestThe maximum number of OBL pages has been set to its maximum value of 40 and processing will continue via the normal switching path."
   ],
   0
  ],
  0.7027930617332458
 ],
 [
  [
   [
    "FMANRP_NAT-4-NONATSERVICE:Service structure is null",
    "An unexpected condition has occurred which is due to the absence of a NAT service structure."
   ],
   1
  ],
  0.6692681908607483
 ],
 [
  [
   [
    "FECPM-3-BSCHUNT:BSC HUNT cmd for int %d/%d failed",
    "An internal error occurred."
   ],
   1
  ],
  0.7187054753303528
 ],
 [
  [
   [
    "AUTHMGR-5-FAIL:Authorization failed or unapplied for client %e on Interface %s AuditSessionID %s",
    "Authorization was unsuccessful."
   ],
   1
  ],
  0.5057691335678101
 ],
 [
  [
   [
    "BCM3220-3-OWNERR:msgtxt_ownerror",
    "An Ethernet interface is malfunctioning or an internal software error occurred."
   ],
   1
  ],
  0.7538861632347107
 ],
 [
  [
   [
    "C542-1-INCORRECT_DSP_ID:VPM at slot %d: Incorrect %d DSP-ID passed by SPI.",
    "The DSP ID provided by the SPI for download is not valid."
   ],
   1
  ],
  0.8105195760726929
 ],
 [
  [
   [
    "CSM-1-UNEXPECTEDEVENT:An Unexpected event received by tone process - %d %d.",
    "An invalid operation was detected by the router"
   ],
   1
  ],
  0.6987746357917786
 ],
 [
  [
   [
    "CRYPTO-4-IPSEC_AAA_START_FAILURE:IPSEC Accounting was unable to send start record",
    "The AAA subsystem was unable to send the accounting starton behalf of IPSec. This could be due to the AAA Server being unreachable."
   ],
   1
  ],
  0.7472522854804993
 ],
 [
  [
   [
    "DMVPN-5-NHRP_NHP_UP:%s: Next Hop %s : Tunnel: %s NBMA: %s for Tunnel: %s NBMA: %s is %s",
    "The flow table was unable to process a TCP fragmented packet. Service for these packets may be unavailable."
   ],
   0
  ],
  0.8032147884368896
 ],
 [
  [
   [
    "DSMIB-3-RECV_CONF:Error receiving configuration in DSMIB.",
    "Reassembly/VFR encountered a runtime error as indicated"
   ],
   0
  ],
  0.7138603329658508
 ],
 [
  [
   [
    "GDOI-3-GM_INCOMPLETE_CFG:Registration: incomplete config for group %s",
    "The fh_hash_md5_fd function reported the specified error."
   ],
   0
  ],
  0.6763001084327698
 ],
 [
  [
   [
    "BFD_OFFLOAD-3-ALLOC_FAILED:Allocation of %s memory failed for BFD Offload feature in QFP",
    "An error occured while CTS IFC attempts to access the link object."
   ],
   0
  ],
  0.6350507736206055
 ],
 [
  [
   [
    "FNF-3-CFT_REG_FAILED:FNF fails to connect to CFT infra.",
    "Cisco internal software error. The dataplane dropped one or more flow records for QoS CAC. This is likely due to buffer allocation error and over-driving the punt/hsl messaging channel."
   ],
   1
  ],
  0.578254759311676
 ],
 [
  [
   [
    "DSX1-1-M32_INPUT_CONGEST:Munich 32 channel input queue is congested",
    "The PMKID received from peer is different from the expected PMKID"
   ],
   0
  ],
  0.7652165293693542
 ],
 [
  [
   [
    "E_CFM-2-INIT_ALLOC_FAIL:Failed to allocate memory required for initialization.",
    "The specified event trace must be enabled before continuous display could occurs."
   ],
   0
  ],
  0.6700664758682251
 ],
 [
  [
   [
    "FILESYS_RFS-3-IPC:%s %s: msg_type [%d] sub_type [%d]:IPC error [%s]",
    "IPC handler initialization failed."
   ],
   0
  ],
  0.6183080077171326
 ],
 [
  [
   [
    "GEN_PROXY-3-REPLY_MSG:wrong version %d",
    "An incorrect SBS message was received by the Generic Client Proxy."
   ],
   1
  ],
  0.7731769680976868
 ],
 [
  [
   [
    "AP-6-POSTURE_START_VALIDATION:IP %i| Interface %s| AuditSessionID %s",
    "Service context has entered Operational state and there is at least one configured node that is not part of the SN view."
   ],
   0
  ],
  0.7730844616889954
 ],
 [
  [
   [
    "CTS-3-ENTROPY_SRC_FAILURE:Entropy source failed health test",
    "CFC registration failed."
   ],
   0
  ],
  0.6326728463172913
 ],
 [
  [
   [
    "DIALSHELF-4-UNRECOMMENDED:Number of %s may exceed recommended configuration",
    "On NPE200 more than one CT3 or more than two T1/E1 are installed this exceeds the recommended configuration."
   ],
   1
  ],
  0.8474968075752258
 ],
 [
  [
   [
    "CTS-6-ENV_DATA_COA_REQUEST:Command %s=%s-%s",
    "A Change of Authorization request command is received for update-env-data"
   ],
   1
  ],
  0.611909031867981
 ],
 [
  [
   [
    "COMMON_MFIB-4-MFIBTABLE:Failed to %s table %s %s",
    "An MFIB table was found to be missing when attempting to perform a change to it. This may be a transient condition"
   ],
   1
  ],
  0.6510518789291382
 ],
 [
  [
   [
    "DSMP-3-MSGSNDFAIL:channel:%s DSP ID:0x%x Message ID:0x%x",
    "Format time failure."
   ],
   0
  ],
  0.7008988261222839
 ],
 [
  [
   [
    "DATA_DESCR-3-GENERIC_VIRTUAL_DECODE:Lookup Failure: %0-8x.%0-8x.%0-8x.%0-8x.%0-8x %u-%u/%u/%u",
    "The router does not have enough memory to perform the function"
   ],
   0
  ],
  0.689194917678833
 ],
 [
  [
   [
    "HA_EM-7-FMFD_MET_RBLD:%s: %s",
    "Internal error. The event detector has failed to rebuild the metric list from the checkpointed records."
   ],
   1
  ],
  0.6378483176231384
 ],
 [
  [
   [
    "CARRIER-3-RESET_DFC:DFC Reset Failed - DFC %d",
    "During OIR Removal process DFC reset failed."
   ],
   1
  ],
  0.596809983253479
 ],
 [
  [
   [
    "DIALER-3-SBINIT:Error initializing %s subblock data structure. %s",
    "Fax call disconnected"
   ],
   0
  ],
  0.7614865303039551
 ],
 [
  [
   [
    "ENSP-4-FMAIL_NO_SMTP:FAXMAIL- Can not connectto the SMTP server",
    "Triggers when an IP datagram is received with the ''protocol'' field of the IP header set to 1 ICMP and the ''type'' field in the ICMP header set to 3 Host Unreachable. This is the common responseLarge numbers of this datagram type on the network are indicative of network difficulties or may be indicative of hostile actions."
   ],
   0
  ],
  0.6447632312774658
 ],
 [
  [
   [
    "IDMNGR-3-INVALIDREQUEST:Error: Invalid request type received %d",
    "Unable to handle a client request"
   ],
   1
  ],
  0.6168462634086609
 ],
 [
  [
   [
    "BDOMAIN-3-STAMAC_SSP_SSO_STAMAC_CFG_FAIL:Standby-SP cannot configure Static MAC to back-end subsystem after reaching SSO mode Reason: %s.",
    "An internal software error occurred."
   ],
   1
  ],
  0.7093306183815002
 ],
 [
  [
   [
    "HA_EM-7-FMFD_OE_CREATE:%s: could not create an occurrence entry",
    "Binding deleted in the SXP database."
   ],
   0
  ],
  0.6041690111160278
 ],
 [
  [
   [
    "CPP_BQS-3-PROXY_IPC_SEND:failure: %s",
    "BQS Proxy send response failed response was dropped."
   ],
   1
  ],
  0.7105681896209717
 ],
 [
  [
   [
    "ETHER_PLATFORM_SW-3-DOT1AH_CHNK_LCK_FAILED:Unable to lock memory while learning C-MAC to B-MAC mapping",
    "cGVRP attempted to reserve a MAC match register for the slot indicated and there is no dedicated register or programmable register available. cGVRP cannot be activated on interfaced of this card."
   ],
   0
  ],
  0.7705826163291931
 ],
 [
  [
   [
    "GDOI-4-GM_RECOVERY_REGISTRATION_POSTPONED:Detects data error in group %s but the previous recovery/rekey has occured within the last recovery-check interval. Postpone recovery registration to start in %d sec",
    "GM recovery feature detects dataplane error and will re-register to KS to refresh keys and policy"
   ],
   1
  ],
  0.5654402375221252
 ],
 [
  [
   [
    "FW-6-DROP_PKT:Dropping %s pkt %i:%u => %i:%u",
    "An interface index was found which didn't match the active interface index table entry with the corresponding sync key due to an internal software error."
   ],
   0
  ],
  0.718533456325531
 ],
 [
  [
   [
    "CE3-3-NOACC:%s - Accumulator is not available",
    "An invalid TX accumulator is detected."
   ],
   1
  ],
  0.753410279750824
 ],
 [
  [
   [
    "CBUS-4-CTRBADLOVE2:Interface %s Unexpected SRB_COMPLETE lovenote command=0x%04x result=0x%04x",
    "The system received an unsolicited message from the Token Ring interface. The system ignored the message and continued normal processing."
   ],
   1
  ],
  0.8027567267417908
 ],
 [
  [
   [
    "GEFC-3-MIB_LOSS_OF_LOCK_ALM:Loss of Lock %s %s %s",
    "This operation to enqueue an IPC message for sending has failed."
   ],
   0
  ],
  0.6952564120292664
 ],
 [
  [
   [
    "CLI_AGENT-4-ECI_IGNORE_MSG:Ignoring %s message: %s",
    "ECI in pull state and ignores the incoming mesage from cli_agent"
   ],
   1
  ],
  0.7910641431808472
 ],
 [
  [
   [
    "GPRSFLTMG-4-GTPv1AAAFAIL_PDPACTIVATIONFAIL:\\ GSN: %i TEID: %x APN: %s Reason: %d %s",
    "A given server-group was listed in a method-list without defining it first. Server-groups should be defined before use."
   ],
   0
  ],
  0.6443964242935181
 ],
 [
  [
   [
    "DC-4-FILE_OPEN_WARNING:Not able to open %s",
    "The device classifier did not find the default profile file or it may  be corrupted. DC is working using built-in profiles."
   ],
   1
  ],
  0.6165892481803894
 ],
 [
  [
   [
    "CALLTREAT_NOSIGNAL-3-HIGH_TOTAL_CALLS:High call volume.\\n",
    "The system is experiencing a high call volume."
   ],
   1
  ],
  0.6290819048881531
 ],
 [
  [
   [
    "CLNS-3-NSAPES:Invalid NSAP type in ES table: %x for %s",
    "An internal software error occurred."
   ],
   1
  ],
  0.7148067355155945
 ],
 [
  [
   [
    "DSM-6-SESSION_DATABASE_FAILED:Cannot create DSM session database\\n",
    "Failed to create DSM session."
   ],
   1
  ],
  0.6254771947860718
 ],
 [
  [
   [
    "DC-3-PATTERN_NOT_FOUND:%s",
    "The device profiles file parsing failed. This indicates that the file may be corrupt. The device classifierwill be operationally down if failure occured for the Embedded profiles."
   ],
   1
  ],
  0.6085833311080933
 ],
 [
  [
   [
    "DUAL-3-NOHANDLE:Handle %d is not allocated in pool.",
    "The number of ALPS peer drops due to maximum size exceeded   exceeds the ALPS peer threshold value."
   ],
   0
  ],
  0.7756825685501099
 ],
 [
  [
   [
    "IDS-4-ICMP_REDIRECT_SIG:Sig:2003:ICMP Redirect - from %i to %i",
    "Triggers when a IP datagram is received with the ''protocol'' field of the IP header set to 1 ICMP and the ''type'' field in the ICMP header set to 5 Redirect."
   ],
   1
  ],
  0.6662889122962952
 ],
 [
  [
   [
    "DSPU-3-CLSIUnexpctIdStnInd:CLSI unexpected IdStnInd header= %s",
    "The slow BGP peer has recovered."
   ],
   0
  ],
  0.7689146399497986
 ],
 [
  [
   [
    "CBR_SPA-3-CORTINA_PHY_DEV_CREATE_ERROR:%s Cortina PHY device create error port %d/%d/%d",
    "Bulk config sync failure the reason for the failure will be provided in the string"
   ],
   0
  ],
  0.7447208762168884
 ],
 [
  [
   [
    "ICE-6-MSG_INF:%s",
    "The given SW subblock doesn't support ISSU so may not be processed correctly on the LC. It has not been registered by the CEF component."
   ],
   0
  ],
  0.7247852683067322
 ],
 [
  [
   [
    "CTS-3-IFC_CACHE_UPDATE_FAIL:Cache Update Failed",
    "An error has occurred loading the commandset for a newly installed package. The package is not compatible with the running IOS instance."
   ],
   0
  ],
  0.5929484963417053
 ],
 [
  [
   [
    "HA_EM-4-FMPD_NO_EVENT:No event configured for applet %s",
    "All attempts to parse this per_user unconfigure command failed. The unconfigure command is called when an error occurs while configuring per-user commands to revert back. The unconfiguration may fail due to parser or AAA error."
   ],
   0
  ],
  0.6692681908607483
 ],
 [
  [
   [
    "FMANRP_SSLVPN-3-RRICHUNKERR:%s",
    "Error has occurred when requested memory for SSLVPN route handling"
   ],
   1
  ],
  0.6018434166908264
 ],
 [
  [
   [
    "FM-4-TCAM_API_FAILURE:Interface %s traffic will be software switched in %s directions",
    "TCAM api failure prevents ACLs from being applied in the TCAM for this interface. Instead a bridge result had been applied for the acl."
   ],
   1
  ],
  0.7126991152763367
 ],
 [
  [
   [
    "GK-3-EXCEED_MAX_LOCAL_ZONE_ALLOWED:\\ Exceeded maximum number of local zones %d allowed.",
    "Record associated with a withdrawn label has timed out before receiving acknowledgements from all peers."
   ],
   0
  ],
  0.6362107992172241
 ],
 [
  [
   [
    "CHKPT-4-NOIPCPORT:IPC port is NULL %s",
    "Checkpoint Facility cannot send the message as the IPC port information is NULL. This message appears since since the communication session between the Checkpointing Facility peers has not yet been established."
   ],
   1
  ],
  0.765500009059906
 ],
 [
  [
   [
    "DIAG-3-INVALID_DEVICE:Invalid device number : %s",
    "A diagnostic request is being made on a device that does not exist"
   ],
   1
  ],
  0.6791235208511353
 ],
 [
  [
   [
    "CPPUI-3-ERROR_NOTIFY:%s",
    "Initialization of attention proxy failed due to error registering IPC handler function."
   ],
   0
  ],
  0.6289284229278564
 ],
 [
  [
   [
    "DOT1X_SWITCH-5-ERR_VLAN_ON_ROUTED_PORT:Attempt to assign VLAN %s to routed 802.1x port %s AuditSessionID %s",
    "Autonomic network VRF has not been created globally"
   ],
   0
  ],
  0.7096445560455322
 ],
 [
  [
   [
    "ILLEGAL-3-XCONNECT:%s",
    "An illegal event has been processed by the xconnect subsystem."
   ],
   1
  ],
  0.5592833757400513
 ],
 [
  [
   [
    "COMMON_MFIB-3-MFIBXDR_ISSUREGERROR:ISSU client %s %d entity %d failed ISSU registration: %s",
    "No such service registered with DFP subystem."
   ],
   0
  ],
  0.7605680227279663
 ],
 [
  [
   [
    "ETHER_SERVICE-3-ETHER_CHAN_SERV_INSTANCE_POLICY_REMOVED:%s service policy %s has been removed from service instance %d of ethernet channel %s due to failure to install the policy on member link %s.",
    "FTP client request failed to change to requested directory."
   ],
   0
  ],
  0.6503446102142334
 ],
 [
  [
   [
    "CALLPROG-3-API_INIT:api front init failed for %s",
    "Failed to get free element from front end queue."
   ],
   1
  ],
  0.5945737957954407
 ],
 [
  [
   [
    "HTSP-3-NOEVENT:no free event structure available from %s for DSP message",
    "There were no event structures remaining in the system pools to alert the router of a voice or signaling event."
   ],
   1
  ],
  0.6973130106925964
 ],
 [
  [
   [
    "FW_HA-3-RF_REG_FAILED:Firewall High availability registration to RF failed",
    "Firewall High Availability could not register as a Redundancy Facility client"
   ],
   1
  ],
  0.7980246543884277
 ],
 [
  [
   [
    "BSTUN-3-BADMAGIC:%s: wrong magic mine %x theirs %x %d",
    "Modem Line Verbose CallTracker Call Record"
   ],
   0
  ],
  0.5011083483695984
 ],
 [
  [
   [
    "AT-6-BADROUTE:Route to %#A has gone bad",
    "The system did not detect a route within the required timeout period. Therefore the route is marked as bad. A network might have become unreachable for some reason perhaps because of a broken connection. This message does not necessarily indicate an error condition."
   ],
   1
  ],
  0.6554577946662903
 ],
 [
  [
   [
    "ENVMON-1-RPS_THERMAL_CRITICAL:RPS temperature has reached critical threshold",
    "Accounting-Session-ID value exceeded max value allowed. Now it is wrapping."
   ],
   0
  ],
  0.7091715931892395
 ],
 [
  [
   [
    "E_CFM-6-MAX_MEPS_EXCEEDED:Maximum MEPs threshold exceeded in %s for domain %s service %s mac %e mpid %d",
    "The number of remote MEP entries in CC database has exceeded the maximum MEPs configured. The current remote MEP is not saved inthe CC database."
   ],
   1
  ],
  0.7810859680175781
 ],
 [
  [
   [
    "AN-6-CONFIG_DOWNLOAD_STARTED:Auto Config Download started on the device",
    "IPC Invalid parameters."
   ],
   0
  ],
  0.7642351984977722
 ],
 [
  [
   [
    "CMANRP-3-INVERR:Unable to process chassis inventory for file %s slot %d %s error %d. Some SPA's may not be fully configured",
    "An unexpected condition has occurred while IOS is trying to process the chassis inventory on startup. IOS can not determine the type and number of all Carrier Cards and SPA's present in the system. Some configuration relating to these SPA's may not be applied and leave the system in an inconsistent state."
   ],
   1
  ],
  0.9632993340492249
 ],
 [
  [
   [
    "CBUS-5-INPUTERR:Interface %s excessive input error rate",
    "An internal software error occurred while handling a user request."
   ],
   0
  ],
  0.8736429810523987
 ],
 [
  [
   [
    "ICE-7-MSG_DBG:%s",
    "Debug Messages"
   ],
   1
  ],
  0.7041577100753784
 ],
 [
  [
   [
    "CTRC-3-NOBUFFS:No buffers available to %s",
    "CTRC attempted to allocate a buffer while performing the  operation described in the message text. A buffer pool does  not contain enough items to satisfy the allocation request."
   ],
   1
  ],
  0.6249886155128479
 ],
 [
  [
   [
    "DSCC4-3-UNKNOWN_SCCS:DSCC4 Incorrect SCC number",
    "An internal software error occurred."
   ],
   1
  ],
  0.6943352818489075
 ],
 [
  [
   [
    "CTS-3-CAP_NOT_COMPATIBLE:CTS HA capability not compatible",
    "CTS HA failed during capability negotiation."
   ],
   1
  ],
  0.7228847742080688
 ],
 [
  [
   [
    "DATA_DESCR-3-GENERIC_ENCODE:Encode failure: %s descriptor type=%d",
    "Initilization of Device classifier Built-in databasefailed. So the device classifier will be operationally down."
   ],
   0
  ],
  0.6702836155891418
 ],
 [
  [
   [
    "FWALL_PROXY-4-PROXY_IPC_UNINIT_POOL_FAILED:%s: %d",
    "Could not destroy chunk pool"
   ],
   1
  ],
  0.6562911868095398
 ],
 [
  [
   [
    "AAA-3-NULLCURSOR:Null cursor",
    "A AAA client has provided a nonexistent attribute cursor to AAA."
   ],
   1
  ],
  0.6731041073799133
 ],
 [
  [
   [
    "CFGMGR-6-APPLYING_RUNNING_CFG:as new master",
    "Configuring fair-queue on the parent queue of an ATM VC is not supported"
   ],
   0
  ],
  0.6177783012390137
 ],
 [
  [
   [
    "IDS-4-IPOPT_RR_SIG:Sig:1001:IP options-Record Packet Route - from %i to %i",
    "Unable to handle a client request"
   ],
   0
  ],
  0.5052569508552551
 ],
 [
  [
   [
    "CTS-0-CTS_EMERG:%s",
    "One or more unexpected portfails asserted"
   ],
   0
  ],
  0.672982394695282
 ],
 [
  [
   [
    "AUTHMGR-5-SUCCESS:Authorization succeeded for client %e on Interface %s AuditSessionID %s",
    "Authorization was successful."
   ],
   1
  ],
  0.5572077631950378
 ],
 [
  [
   [
    "AC-3-ACMGR_INVALID_MSG:Received %s",
    "The software detected an invalid packet."
   ],
   0
  ],
  0.7624768018722534
 ],
 [
  [
   [
    "DIGISIGN-3-NET_BOOT:Netbooted software used for key revocation\\n",
    "System was netbooted using a software in a remote device.It is recommended to boot the system using a software in the local device for the key revocation process."
   ],
   1
  ],
  0.6630815863609314
 ],
 [
  [
   [
    "CLSDR-3-ERRRTN:%s failed error 0x%x",
    "A label distribution protocol LDP peer has requested an action which is not currently implemented by the label distribution and control subsystem."
   ],
   0
  ],
  0.8248310685157776
 ],
 [
  [
   [
    "DSG-5-CFRRMTUNNEL:cfr %d becomes unresolved it will be removed from the tunnel it belongs to",
    "SXP received a binding forwarding request."
   ],
   0
  ],
  0.7458282113075256
 ],
 [
  [
   [
    "CLUE-3-COMMIT_FAILED:CLUE cannot commit record id %d",
    "The device is removed from the AN domain it can happen if the domain certificate is NULL or if the domain certificate is invalid"
   ],
   0
  ],
  0.5882018804550171
 ],
 [
  [
   [
    "FMANRP_SSLVPN-3-VWCONFERR:Failed %s: %s",
    "This is an internal software error in the AAA server group subsystem."
   ],
   0
  ],
  0.7526648640632629
 ],
 [
  [
   [
    "DIAG-6-BYPASS:%s: Diagnostics is bypassed",
    "ENV data refresh timer"
   ],
   0
  ],
  0.6774483919143677
 ],
 [
  [
   [
    "AAAA-3-NOREG:%s method %d has no registry!",
    "The MPLS TE Link Management counters have been cleared"
   ],
   0
  ],
  0.7348636984825134
 ],
 [
  [
   [
    "CTS-6-IFC_LICENSE_ERR_STATE:Interface Controller in LICENSE ERR state for int%s",
    "IFC Entering LICENSE ERR State"
   ],
   1
  ],
  0.614798367023468
 ],
 [
  [
   [
    "DSMP-3-PRG_ERROR:Programming Error : %s",
    "An attempt to parse a license related CLI failed"
   ],
   0
  ],
  0.6094504594802856
 ],
 [
  [
   [
    "CTRC-3-SNASWSTOPPED:SNASW was stopped -- existing connections have been closed.",
    "Timeout while waiting on the specified event."
   ],
   0
  ],
  0.7625713348388672
 ],
 [
  [
   [
    "HTSP-3-NOEVENT:no free event structure available from %s for DSP message",
    "An internal buffer used to assemble a string was exceeded thus possibly corrupting other memory."
   ],
   0
  ],
  0.6212547421455383
 ],
 [
  [
   [
    "GEFC-3-MIB_LOSS_OF_LOCK_ALM:Loss of Lock %s %s %s",
    "Loss of Lock"
   ],
   1
  ],
  0.604661762714386
 ],
 [
  [
   [
    "HA_EM-7-ACTION_CNS_AGENT_UNAVAIL:%s: CNS Event Agent not available: %d",
    "This operation to build a TDL message for address range configuration has failed."
   ],
   0
  ],
  0.5613912343978882
 ],
 [
  [
   [
    "ERP_G8032-3-APS_CHANNEL_INACTIVE:No longer receiving R-APS messages for ethernet ring %s instance %d",
    "The ATM core redundancy subsystem encountered an internal software  error. The error message contains text which can be used  to help identify the nature of the problem."
   ],
   0
  ],
  0.6777735352516174
 ],
 [
  [
   [
    "GE_LINK-5-AUTONEGOTIATION:Waiting for completed A/N in GE pair %d primary port",
    "A software component within the router needs memory optimization."
   ],
   0
  ],
  0.5377410054206848
 ],
 [
  [
   [
    "CHOPIN-1-NOTREADY:Not ready for download.",
    "Error on the communication path between DRIVER and CHOPIN"
   ],
   1
  ],
  0.778866708278656
 ],
 [
  [
   [
    "CSM_VOICE-3-NOSDB:No signaling data block is available to build the  voice interface%d/%d:%d",
    "Unable to get message from the queuemessage received from cli-agent. There might be memory issue in IOSD."
   ],
   0
  ],
  0.668239951133728
 ],
 [
  [
   [
    "ESCON-3-LOSS_OF_LIGHT_ALM:Transceiver Loss of Light %s",
    "Transceiver has Cable cut or removed"
   ],
   1
  ],
  0.7157819271087646
 ],
 [
  [
   [
    "FR_HA -3-SYNC:%s: code %d",
    "Generated when the Flow scale limit is reached on LC and new flowtries to learn"
   ],
   0
  ],
  0.5988600850105286
 ],
 [
  [
   [
    "FMANRP_ACL-4-INVALIDV6OP:Operation is invalid",
    "An unexpected condition has occurred which is due to the operation  performed"
   ],
   1
  ],
  0.7854261994361877
 ],
 [
  [
   [
    "CFC_LISP-5-IGNOREICMPMTU:Ignoring received ICMP Type 3 Code 4 %s->%s next hop mtu %u due to pmtu min or max setting",
    "spare pair short detect error has occurred power on spare pair will not be supplied"
   ],
   0
  ],
  0.5857979655265808
 ],
 [
  [
   [
    "CLNS-4-AUTH_FAIL:%s: %s authentication failed",
    "An ISIS packetIIH CSNP PSNP or LSP was received and did not pass authentication check."
   ],
   1
  ],
  0.8401156663894653
 ],
 [
  [
   [
    "DYNCMD-3-PKGINT_LOAD:Failed to load '%s': %s",
    "Some features' configuration depends on a packaging infrastructure.Packaged configuration for the specified package will be unavailable."
   ],
   1
  ],
  0.7123790979385376
 ],
 [
  [
   [
    "AT-3-NOBESTPATH:Could not compute best path for network %#A",
    "The ACL has too many entries. GDOI will honor only the first 100 ACL entries specified."
   ],
   0
  ],
  0.6717369556427002
 ],
 [
  [
   [
    "FMANRP_SSLVPN-3-RRITDLERR:%s%s. %s",
    "An unexpected condition has occurred in processing of SSLVPN routeinject/remove message"
   ],
   1
  ],
  0.7301161289215088
 ],
 [
  [
   [
    "CALL_CONTROL-3-NORAWMSG:no free raw msg structure available from %s for signaling message",
    "There were no rawmsg structures remaining in the system pools to alert the router of a voice or signaling event."
   ],
   1
  ],
  0.5169126391410828
 ],
 [
  [
   [
    "ATTN-2-PROXY_INIT_FAIL_IPC_REG:return code %d",
    "Data descriptors are used to encode an interface index in a compact fashion for transfer between redundant route processor units. An error occurred during the processing of a data descriptor. The failure most likely occurred because of a software error. The numeric error code in the message output identifies the failing data descriptor index. The system state between the Active and Standby units might not be properly synchronized."
   ],
   0
  ],
  0.6908034086227417
 ],
 [
  [
   [
    "FMD-3-DBINITFAILED:Database Init failed",
    "FASTHELLO STATUS CHANGED to UP with more detail status"
   ],
   0
  ],
  0.653092622756958
 ],
 [
  [
   [
    "DSPRM-5-SETCODEC:Configured codec %d is not supported with this dsp image.",
    "Codec negotiation failed."
   ],
   1
  ],
  0.7246909737586975
 ],
 [
  [
   [
    "BSTUN-3-BADPASSIVEOPEN:passive open from %i%d -> %d failed",
    "The command \\'hw-module slot <shelf>/<slot> reload\\' was entered. This is a confirmation that the command is being processed."
   ],
   0
  ],
  0.8110845685005188
 ],
 [
  [
   [
    "CMM-3-REGISTRY_ADD_ERR:Failure in adding to %s registry",
    "Unexpected value returned from underlying DTLS library."
   ],
   0
  ],
  0.7140283584594727
 ],
 [
  [
   [
    "CES-2-INTERNAL_CRITICAL:%s",
    "A failure has occured relating to an incorrect functional parameters."
   ],
   0
  ],
  0.7759366035461426
 ],
 [
  [
   [
    "CBR_SPA-3-RAPTOR_SEM_HI_INTERRUPT:%s %s err_report_reg 0x%x stat_reg 0x%x",
    "Startup Config file was sent to the Standby CPU"
   ],
   0
  ],
  0.6686279773712158
 ],
 [
  [
   [
    "ICE-6-MSG_INF:%s",
    "Program information"
   ],
   1
  ],
  0.6193202137947083
 ],
 [
  [
   [
    "ETHER_SERVICE_IPC-3-IPC_RESP_ERROR:IPC send response error %s",
    "Triggers when a connection drops  and there is no previous connection."
   ],
   0
  ],
  0.673008918762207
 ],
 [
  [
   [
    "AUTHMGR_SPI-3-SPI_FAIL:Auth Manager SPI server %s SPI error: %d",
    "This may be an intermittent or permanent hardware failure."
   ],
   0
  ],
  0.6397911906242371
 ],
 [
  [
   [
    "CTS-3-AUTHZ_POLICY_PEER_DOWNLOAD_FAILED:Failed to download peer policy for %s",
    "The file failed the CRC checking process. This failure indicates a corrupt FPD image bundle or package file."
   ],
   0
  ],
  0.6924326419830322
 ],
 [
  [
   [
    "CIRRUS-3-BADTXISR:Interface serial %d Unexpected situation in transmit ISR",
    "The OIR facility detected the insertion of a PEM from slot [n]."
   ],
   0
  ],
  0.6801754236221313
 ],
 [
  [
   [
    "DLSWP-3-PEERFAILURE:%s %s",
    "An Ethernet interface is malfunctioning."
   ],
   0
  ],
  0.8227851986885071
 ],
 [
  [
   [
    "IDBINDEX_SYNC-3-ISSU_ERR:%s%s rc=%d",
    "The interface index sync ISSU client has error."
   ],
   1
  ],
  0.9172783493995667
 ],
 [
  [
   [
    "FR-5-CONVERT_ROUTE:Converting route pair to connect",
    "A CPP access was traced"
   ],
   0
  ],
  0.7225669622421265
 ],
 [
  [
   [
    "DSC-4-MANUALBOOT:Setting config-register to 0x0 will prevent the feature boards from booting when router shelf is rebooted",
    "Dial-shelf Controller cannot be booted manually"
   ],
   1
  ],
  0.5349031090736389
 ],
 [
  [
   [
    "AAA-5-USER_UNLOCKED:User %s unlocked by %s",
    "IOS received a message to add a command into the CLI. One of the command nodes to be created is of a type unknown to IOS"
   ],
   0
  ],
  0.7817391753196716
 ],
 [
  [
   [
    "AUTORP-4-PRM_DEL:Error expiring semi-static RP-mapping entry %i/%d RP:%i",
    "A processor indicated an error condition while downloading microcode. The status cmd/data and pos numbers shown in the message reflect the error condition the last byte of microcode loaded and the position in the file respectively. If this error appears the microcode download is aborted and the ROM microcode is loaded."
   ],
   0
  ],
  0.6480357050895691
 ],
 [
  [
   [
    "DC-3-SM_GET:Failed to get %s.",
    "License contract violation! Enforced"
   ],
   0
  ],
  0.810858428478241
 ],
 [
  [
   [
    "BFD_OFFLOAD-3-INIT_FAILED:Initialization of the BFD Offload feature in QFP failed",
    "One or more pending unexpected interrupts"
   ],
   0
  ],
  0.5862088799476624
 ],
 [
  [
   [
    "FMANRP_SSLVPN-4-AAAFRIPWARN:%s Invalid framed ip address %i received from AAA.Not sending user config",
    "Wrong AAA server config."
   ],
   1
  ],
  0.6197097301483154
 ],
 [
  [
   [
    "AN-3-ANRA_WHITELIST_FILE_ERROR:ANRA dev id %s domain id %s - error in reading from whitelist file %s will continue without any whitelist devices",
    "The autonomic registeration authority encountered file error when reading from whitelist file check the file name and its contents"
   ],
   1
  ],
  0.5600906610488892
 ],
 [
  [
   [
    "FMANRP_NAT-3-PORTLISTTYPE:Address type %d for global address in the portlist allocation request is not supported",
    "FMANRP_NAT_LIMIT"
   ],
   1
  ],
  0.6694586277008057
 ],
 [
  [
   [
    "CLNS-3-MFIERR:ISIS MFI API error: %s %s",
    "An error occurred while trying to clear the encapsulation data for an EFP."
   ],
   0
  ],
  0.651653528213501
 ],
 [
  [
   [
    "AUTHMGR-7-FAILOVER:Failing over from '%s' for client %s on Interface %s AuditSessionID %s",
    "Failing over from the current authentication method"
   ],
   1
  ],
  0.9150704145431519
 ],
 [
  [
   [
    "DIAG-6-DIAG_OK:%s: Passed %s",
    "The diagnostic tests did not detect any error on the card."
   ],
   1
  ],
  0.9064614176750183
 ],
 [
  [
   [
    "FWALL_PROXY-3-PROXY_HSL_BIND_TEMPLATE_FAILED:%d",
    "HSL bind tempalte failed at given index."
   ],
   1
  ],
  0.7990867495536804
 ],
 [
  [
   [
    "ENV_MON-6-INSFAN:The Fan tray has been inserted into slot %d",
    "The OIR facility detected the insertion of a PEM from slot [n]."
   ],
   1
  ],
  0.606593906879425
 ],
 [
  [
   [
    "ATM-3-FAILREMOVEVC:ATM failed to remove VCVCD=%d VPI=%d VCI=%d on Interface %s Cause of the failure: %s",
    "Socket_recv error receiving message from DFP Manager"
   ],
   0
  ],
  0.5711051821708679
 ],
 [
  [
   [
    "AN-6-CONFIG_DOWNLOAD_SUCCESS:Auto Config Download for the device with UDI- %s is Success",
    "Download of the config file to the Running config is Successful"
   ],
   1
  ],
  0.5297650694847107
 ],
 [
  [
   [
    "IDS-4-LOST_CONNECT:Connection to HostID:%u OrgID:%u",
    "Reject GM registration because this is a secondaryKS and it has not received KGS seed and rekey-epoch from primaryKS yet"
   ],
   0
  ],
  0.7074750661849976
 ],
 [
  [
   [
    "ILACC-5-LATECOLL:Unit %d late collision error",
    "An Ethernet transceiver is malfunctioning the Ethernet is overloaded or the Ethernet cable is too long."
   ],
   1
  ],
  0.7790408730506897
 ],
 [
  [
   [
    "CPPEXMEM-4-LOWMEM:CPP %d %s memory low - %d percent depleted",
    "The trap variable was not added to the queue."
   ],
   0
  ],
  0.651653528213501
 ],
 [
  [
   [
    "BW_LICENSE-5-THROUGHPUT_THRESHOLD_LEVEL:Average throughput rate exceeded %d percent of licensed bandwidth of %s during %d sampling periods in the last 24 hours sampling period is %d seconds",
    "A QFP resource has recovered from the critical level."
   ],
   1
  ],
  0.8407819867134094
 ],
 [
  [
   [
    "AAAA-3-NOREG:%s method %d has no registry!",
    "An internal error has occurred"
   ],
   1
  ],
  0.6924326419830322
 ],
 [
  [
   [
    "CCPROXY-3-NO_RASREQ_TABLE:\\ Unable to allocate memory for %d RAS request table entries in %s.\\n",
    "A method list function encountered a server type that was unknown or could not be handled. This may be due to a server misconfiguration."
   ],
   0
  ],
  0.6271337866783142
 ],
 [
  [
   [
    "AN-6-DEVICE_ALLOWED_BY_ANRA:Device udi %s is allowed by ANRA in its domain %s",
    "The autonomic network registration authority has authorised this device to enter its network"
   ],
   1
  ],
  0.6036555171012878
 ],
 [
  [
   [
    "FECPM-3-INVALID_SCC:Config req for invalid SCC via int %d/%d",
    "The 'virtual' port adaptor type derived from the mainboard type isnot one of the supported types. It may be that this mainboard is a newmainboard type and the software release you are running does not supportthe new mainboard type."
   ],
   0
  ],
  0.6061403751373291
 ],
 [
  [
   [
    "ATMPA-3-TXINDERROR:%s Tx Indication FIFO full.",
    "TX Indication FIFO full. From TX FPGA."
   ],
   1
  ],
  0.673008918762207
 ],
 [
  [
   [
    "BITS_CLK-3-GEN_FRM_STATE_UP:BITS Controller is Up.",
    "The environmental monitor detected a high-voltage condition."
   ],
   0
  ],
  0.7014022469520569
 ],
 [
  [
   [
    "CNS-5-CONFIG_SUCCESS:SUCCESSFUL_COMPLETION",
    "The environmental monitor detected a high-temperature condition."
   ],
   0
  ],
  0.677528977394104
 ],
 [
  [
   [
    "FMANRP_SSLVPN-3-VWCONFERR:Failed %s: %s",
    "An unexpected condition has occurred during WebVPN Context configuration causing failure."
   ],
   1
  ],
  0.6991621255874634
 ],
 [
  [
   [
    "AAA-3-DROPACCTFAIL:Accounting record dropped send to server failed: %s",
    "An attempt to send an accounting record to a server failed. This happens when device exhaust all its retries and retransmission. The cause for this be the servers may not be operational or the NAS is not configured properly."
   ],
   1
  ],
  0.5264581441879272
 ],
 [
  [
   [
    "CTS-3-POLICY_HA_PROC_FAIL:Error starting up HA switchover Policy refresh process.",
    "The userid used to connect to the remote database server is not valid."
   ],
   0
  ],
  0.5184702277183533
 ],
 [
  [
   [
    "FEC_ISSU-3- TRANSFORM:FEC ISSU client %s transform failed error %s",
    "If the alarm appears when this is asserted for a standby processor with a different software image it indicates an alarm condition on the peer that the active processor can not decode. If this is asserted for the active processor it indicates a software error condition."
   ],
   0
  ],
  0.7437962293624878
 ],
 [
  [
   [
    "IM_EEPROM-3-FIELD_NOT_FOUND:%s: Failed to find content of field type 0x%x with data size = %d bytes. The EEPROM might require an update.",
    "An internal error has occured."
   ],
   0
  ],
  0.6876883506774902
 ],
 [
  [
   [
    "FIB-3-MAC_ACCT:%s: %s",
    "Informs user that there is an error in the ACL with regards to thenumber of ports."
   ],
   0
  ],
  0.7208614945411682
 ],
 [
  [
   [
    "CBUS-3-CTRCMDFAILED:Interface %s CTR Command %s Failed %s %#04x",
    "An unrecoverable software error occurred while trying to merge the configured port acl features."
   ],
   0
  ],
  0.5562902092933655
 ],
 [
  [
   [
    "COMMON_FIB-3-FIBDEPDUMP:%s",
    "SXP received conflicting sgt value from different SXP peer for the same IP prefix."
   ],
   0
  ],
  0.6714107394218445
 ],
 [
  [
   [
    "CSM_SLB-4-PROBECONFIG:Module %d probe configuration error: %s",
    "Health probe configuration failed."
   ],
   1
  ],
  0.6671016812324524
 ],
 [
  [
   [
    "CMTS-3-MCAST_SES_MISMATCH:Session Request Response Mismatch for transaction ID %d session %s%s CM %e",
    "Internal error occured during communication with Session Manager.This may cause the show command not to display the device classification results."
   ],
   0
  ],
  0.5885574817657471
 ],
 [
  [
   [
    "FLEXDSPRM-3-TDM_CONNECT:failed to connect voice-port %d/%d/%d to dsp_channel%d/%d/%d",
    "\\nTo handle Modem-on-Hold attribute we need connectivity with modems supporting V.92 modem standards. If there is no modem there wouldn't be any tty without which we cannot use MOH attributes."
   ],
   0
  ],
  0.7136561274528503
 ],
 [
  [
   [
    "GEN_DB-3-NO_KEY_FUNC:%s: %s %s",
    "This message indicates that key functions are missingfrom the database handle or key function is a NULL Pointer"
   ],
   1
  ],
  0.7598328590393066
 ],
 [
  [
   [
    "AT-6-BADROUTE:Route to %#A has gone bad",
    "COMMON_MFIB_INTERNAL_ERROR"
   ],
   0
  ],
  0.7030870914459229
 ],
 [
  [
   [
    "DEC21140-3-DUPLEX_SPEED:%s doesn't support the configured duplexand speed combination",
    "ACL logging has encountered unexpected pkt type."
   ],
   0
  ],
  0.7036859393119812
 ],
 [
  [
   [
    "IDS-4-IP_UNKNOWN_PROTO_SIG:Sig:1101:Unknown IP Protocol - from %i to %i",
    "Triggers when an IP datagram is received with the protocol field set to 101 or greater. The use of these protocol types is highly unusual and should be investigated."
   ],
   1
  ],
  0.5106148719787598
 ],
 [
  [
   [
    "ETHERNET_OAM-6-DYING_GASP:The client on interface %s has received a Dying Gasp indication from its remote peer failure reason = %s action = %s",
    "An error occurred during an NVGEN command"
   ],
   0
  ],
  0.6823002696037292
 ],
 [
  [
   [
    "DSPU-3-CLSIUnexpctActSapCnf:CLSI unexpected ActivateSapCnf header= %s",
    "General error indicating an incorrect action"
   ],
   0
  ],
  0.7899968028068542
 ],
 [
  [
   [
    "BDOMAIN-3-MACSEC_BE_INIT_FAIL:Bridge-domain MAC Security back-end subsystem did not initialize correctly Reason: %s.",
    "An internal software error occurred."
   ],
   1
  ],
  0.6502096056938171
 ],
 [
  [
   [
    "AAA-3-MLIST_INTERNAL_ERROR:method list '%s': %s",
    "This is an internal software error."
   ],
   1
  ],
  0.7851617336273193
 ],
 [
  [
   [
    "FTPSE-3-MSG_ERR:%s",
    "DMB_INTERNAL_ERROR"
   ],
   0
  ],
  0.7068512439727783
 ],
 [
  [
   [
    "CTS-1-SXP_BINDING_EXP:Binding %s<%s %s> can't be expanded. Expanded %d and maximum allowed is %d\\nBinding propagated in the network is not consistent.",
    "Failure occurred while initializing APF HA subsystem."
   ],
   0
  ],
  0.716245710849762
 ],
 [
  [
   [
    "DBMS-2- INITIALIZATION_FAILED:DBLIB initialization failed for %s",
    "Initialization of the database library failed."
   ],
   1
  ],
  0.7269434928894043
 ],
 [
  [
   [
    "FMANRP_ESS-4-FULLVAI:Session creation failed due to Full Virtual-Access Interfaces  not being supported. Check that all applied Virtual-Template  and RADIUS features support Virtual-Access sub-interfaces.  swidb= %#x ifnum= %d",
    "Config Manager was notified about member that it already knows about"
   ],
   0
  ],
  0.7141863703727722
 ],
 [
  [
   [
    "DBUS-3-DBUSINTERR:Slot %d Internal Error",
    "Resource temporarily not available"
   ],
   0
  ],
  0.7135301232337952
 ],
 [
  [
   [
    "CBUS-3-SERRSET:Interface %s Error %-04x %s - serial_reset",
    "A software error occurred."
   ],
   1
  ],
  0.7316907048225403
 ],
 [
  [
   [
    "CBR_SPA-3-ESI_SUP_CTRL_REG_WRITE_ERROR:%s unable to write to Raptor ESI CONTROL REG err %d",
    "The system does not have enough main memory RAM for TCP to allocate the data structures required to accept an incoming TCP connection. Most likely the router image requires more system memory RAM than the router contains."
   ],
   0
  ],
  0.5436385273933411
 ],
 [
  [
   [
    "HA-2-CCB_RECORD_ERROR:CCB record failed.",
    "This is a critical error message about a High Availability System status or condition."
   ],
   1
  ],
  0.6107413172721863
 ],
 [
  [
   [
    "CBR_SPA-3-ESI_PIC_STATUS_REG_READ_ERROR:%s unable to read from Raptor ESI PIC STATUS REG err %d",
    "Unable to communicate with Raptor Device driver"
   ],
   1
  ],
  0.6950327157974243
 ],
 [
  [
   [
    "DLSWC-3-BADSSPHDR:bad ssp hdr in proc ssp - %s = 0x%x",
    "An unexpected condition has occurred which is due to the operation  performed"
   ],
   0
  ],
  0.7004621624946594
 ],
 [
  [
   [
    "CPPDRV-6-ACCTRC8B:Access CPP %d address 0x%08llX Blk/Off:%d/0x%08llX %s %3d bytesmsgdef_explanation",
    "An unexpected condition has occurred which is due to the absence of a sampler-map structure"
   ],
   0
  ],
  0.7057933211326599
 ],
 [
  [
   [
    "CPPHA-7-START:CPP %d %s",
    "A CPP is being started."
   ],
   1
  ],
  0.6598805785179138
 ],
 [
  [
   [
    "ETC-5-ERRPROT2:Command rejected: the interface %s is already part of a channel with a different type of protocol enabled",
    "The GigabitEthernet controller has signalled an error condition."
   ],
   0
  ],
  0.6531307697296143
 ],
 [
  [
   [
    "IDBMAN-3-DELETEDAGGPORT:%s%d / %d Group %d has been deleted but is being reused.",
    "There is an internal error that caused an interface that has been deleted to be reused for a new aggregate port."
   ],
   1
  ],
  0.682700514793396
 ],
 [
  [
   [
    "FECPM-3-SCCRESET:SCC reset for int %d/%d at %s failed",
    "There has been an internal error relating to CoA command processing."
   ],
   0
  ],
  0.6684749126434326
 ],
 [
  [
   [
    "CMM-6-CONFIG_NOT_ALLOWED:Centrally Managed MA: \\%s\\ cannot be locally configured.",
    "This Mobility Agent is Centrally Managed hence this CLI is not allowed. Configuration needs to be done on the Mobility Controller."
   ],
   1
  ],
  0.5829043984413147
 ],
 [
  [
   [
    "FB_COREDUMP-3-NOMEMORY:No Memory or buffer for %s to be send to %d",
    "CT3 initialization failure."
   ],
   0
  ],
  0.7088512182235718
 ],
 [
  [
   [
    "CPP_BQS-3-INVALID_SUBTYPE:CPP BQS RM Proxy subtype %u",
    "BQS proxy failed because of receiving invalid sub-type or failed to allocate ipc response buffer."
   ],
   1
  ],
  0.7792838215827942
 ],
 [
  [
   [
    "ETHERNET_OAM-6-LOOPBACK:Interface %s has %s the %s loopback mode.",
    "The specified interface has entered or exited loopback mode because of protocol control or an external event such as the interface link going down."
   ],
   1
  ],
  0.6538268327713013
 ],
 [
  [
   [
    "COLLECTOR-3-REMOVE_FAIL:The collector name is unrecognized",
    "The Collector name give does not match the collector configured"
   ],
   1
  ],
  0.9200176000595093
 ],
 [
  [
   [
    "HA_EM-6-FMPD_CONTEXT_SAVE:Failed to save variable context for key %s: %s",
    "This message indicates that a list operations such as enqueue dequeu failed"
   ],
   0
  ],
  0.6195604205131531
 ],
 [
  [
   [
    "COMMON_MFIB-3-MFIBXDR_ISSUREGERROR:ISSU client %s %d entity %d failed ISSU registration: %s",
    "COMMON_MFIB_INTERNAL_ERROR"
   ],
   1
  ],
  0.7126991152763367
 ],
 [
  [
   [
    "FWALL_PROXY-3-PROXY_IPC_SEND_SCB_QUERY_FAILED:%d",
    "HSL modify destination failed."
   ],
   0
  ],
  0.7218061089515686
 ],
 [
  [
   [
    "COMMON_FIB-4-FIBHWIDBMISMATCH:Mis-match between hwidb %s ifindex %d and fibhwidb %s ifindex %d",
    "Record Generated Exceeded Syslog Capability"
   ],
   0
  ],
  0.6996585726737976
 ],
 [
  [
   [
    "HAL-1-INITFAILP:%s init failed at %s",
    "An unrecoverable software error occurred while trying to merge the configured input features."
   ],
   0
  ],
  0.7497273683547974
 ],
 [
  [
   [
    "CLUE-3-INVALID_REC_DATA_SIZE:CLUE record size %d is invalid to allocate CLUE record %d",
    "Internal error. May result in unpredictable behaviour."
   ],
   0
  ],
  0.6566786170005798
 ],
 [
  [
   [
    "DSX1-3-M32_BAD_STATE:Munich 32 in unknown state: Ctrl = 0x%08x Channel = %d",
    "The specified fan has changed status to an acceptable condition. This is an informational message only. It will be displayed after replacement of a bad fan or any time the software determines a failure condition has ended."
   ],
   0
  ],
  0.6654525995254517
 ],
 [
  [
   [
    "FW-5-POP3_NON_SECURE_LOGIN:%sLOGON POP3 command from initiator %i:%d: %s",
    "OTV Site ID received from a neighbor in the same site has a different site id indicating a misconfiguration error."
   ],
   0
  ],
  0.7335065007209778
 ],
 [
  [
   [
    "FR_VIP-3-INCONSISTENT:Invalid state on VIP: DLCI %d: Slot %d: Error code %d",
    "An error occurred while processing FR state on the VIP"
   ],
   1
  ],
  0.7175924181938171
 ],
 [
  [
   [
    "FPGA-2-DOWNLOAD:Download Fail FPGA# %d",
    "Unknow trap type. Some feature requires this trap type to be handled"
   ],
   0
  ],
  0.6886615753173828
 ],
 [
  [
   [
    "DBMS-3- MESSAGE:%s",
    "The specified operation in the message component failed."
   ],
   1
  ],
  0.6868299245834351
 ],
 [
  [
   [
    "DMVPN-5-CRYPTO_SS:%s: local address : %s remote address : %s socket is %s",
    "DMVPN Crypto UP/DOWN Syslog Event"
   ],
   1
  ],
  0.656118631362915
 ],
 [
  [
   [
    "AAAA-3-ACCTDUMP:dump of accounting data:",
    "Failure to allocate memory for connection hash table."
   ],
   0
  ],
  0.6769585609436035
 ],
 [
  [
   [
    "BFD-3-WAVL_INSERT_FAIL_MPLS_TP_LSP:Failed inserting node for LSP %s %s to wavl tree thread %d %s",
    "A new AppleTalk path has been learned. The message indicates the source of the path its distance in hops its metric and the type of path."
   ],
   0
  ],
  0.6923050880432129
 ],
 [
  [
   [
    "ALPS-7-PEER_DROPS_VERSION_MISMATCH:Threshold exceeded for version mismatch peer drops for peer %i %s.",
    "The remote BGP peer sent in a route with an invalid optional transitive attribute."
   ],
   0
  ],
  0.6793962717056274
 ],
 [
  [
   [
    "ADJ_WALK_ERR-2-MPLS_TE:%s",
    "Error during bundle adjacency walk"
   ],
   1
  ],
  0.5028014183044434
 ],
 [
  [
   [
    "CES-3-INTERNAL_ERROR:%s",
    "Link Event detected for non-SFP port of GigE Transceiver"
   ],
   0
  ],
  0.6301767230033875
 ],
 [
  [
   [
    "FWALL_PROXY-3-PROXY_ICMP_ERROR_MEM_INIT_FAILED:Blank - Please provide info",
    "An ALPS circuit sent a Circuit Update message and  received a Circuit Open Failed message as a reply."
   ],
   0
  ],
  0.5320512056350708
 ],
 [
  [
   [
    "CLI_ADD_FAILED-3-MPLS_TE_HA:Failed to add RSVP HA to CLI",
    "system may be low on memory"
   ],
   1
  ],
  0.8107861876487732
 ],
 [
  [
   [
    "ATMPA-3-NOVPSPACE:%s Runs out of VP space for vpi %d",
    "The Port Adapter has failed its initialization."
   ],
   0
  ],
  0.6786884069442749
 ],
 [
  [
   [
    "DNSSERVER-3-TCPDNSOVERLOAD:Low available memory: dropping TCP request from <cli %i>.",
    "Timers not supported for software sessions"
   ],
   0
  ],
  0.6665604114532471
 ],
 [
  [
   [
    "CBR_SPA-3-ESI_PLL_CTRL_LOCK_ERROR:%s unable to lock Raptor ESI PLL",
    "An internal error occured when looking up policer statistics."
   ],
   0
  ],
  0.7362724542617798
 ],
 [
  [
   [
    "AUTO_IP_RING-5-LLDP_NOT_ENABLE_ON_THIS_INTERFACE:port %s: lldp not enabled for interface please enable lldp on this interface",
    "An internal inconsistency was detected in the XNS routing table structure."
   ],
   0
  ],
  0.5186452269554138
 ],
 [
  [
   [
    "DIAG-4-CONFIG_REAPPLY:reapply config command '%s' after the card is online.",
    "The specified config command cannot be applied."
   ],
   1
  ],
  0.846865177154541
 ],
 [
  [
   [
    "C542-1-NO_RING_DESCRIPTORS:No more ring descriptors available on %d slot.",
    "The c542 driver cannot queue messages upto the xilinx dma engine for transmit."
   ],
   1
  ],
  0.6624982357025146
 ],
 [
  [
   [
    "CPU_REDUN-3-RCSF_FAIL:Attempt to sync running config to standby failed",
    "Unable to send Running Config file to Standby CPU"
   ],
   1
  ],
  0.6270691156387329
 ],
 [
  [
   [
    "COMP-5-NOBUF:Interface %s %s",
    "Software error caused failure in programming ACLs into the TCAM."
   ],
   0
  ],
  0.7962777018547058
 ],
 [
  [
   [
    "CSM_SLB-6-REDUNDANCY_INFO:Module %d FT info: %s",
    "Some event occurred in CSM-SLB fault tolerance."
   ],
   1
  ],
  0.6018434166908264
 ],
 [
  [
   [
    "CBR_LIC-6-LCHA_LIC_RESTRICTED:%s %s",
    "When oir-remove-failing-slot is invoked the software attempts to initialize parameters. This initialization failed and the service will not be available."
   ],
   0
  ],
  0.6837399005889893
 ],
 [
  [
   [
    "CBR_SPA-3-SPA_PLUGIN_INIT_ABORT_ERROR:%s SPA Plugin Init Abort error",
    "Unknown SPA Init phase"
   ],
   1
  ],
  0.6429123282432556
 ],
 [
  [
   [
    "DOT1AD-4-DOT1QTUNNEL_PORT:Port %s is a dot1q-tunnel port it conflicts with Dot1ad configuration",
    "The specified operation in the shadow component failed."
   ],
   0
  ],
  0.716437816619873
 ],
 [
  [
   [
    "CTS-6-POLICY_RBACL_MONITOR_ALL:Failed to set monitor all for dynamic policies",
    "An error occurred while CTS attempted to set monitor flag for all dynamic installed policies."
   ],
   1
  ],
  0.657086193561554
 ],
 [
  [
   [
    "BFD-6-TX_ON_STANDBY:BFD transmit detected on standby",
    "BFD packet transmission on standby"
   ],
   1
  ],
  0.7043149471282959
 ],
 [
  [
   [
    "ALARM-3-NOCLASS:Unknown Alarm Severity Class",
    "The timer services had exceeded the maximum number of timer heartbeat sequence number errors."
   ],
   0
  ],
  0.5253623723983765
 ],
 [
  [
   [
    "DRP-3-NOWRITE:unable to send response to %i:%d",
    "A software or hardware error occurred."
   ],
   1
  ],
  0.6373071074485779
 ],
 [
  [
   [
    "AAAA-4-SERVNOGRP:Warning: Server %i:%d%d is not part of server group %s.",
    "The server does not belong to the specified server group"
   ],
   1
  ],
  0.6627933382987976
 ],
 [
  [
   [
    "ENV_MON-6-INTERNAL_ERROR:Internal error %d in %s - contact Cisco technical support",
    "The bandwidth requirements of the installed port adapters exceed the processor's rated capability."
   ],
   0
  ],
  0.7320849895477295
 ],
 [
  [
   [
    "HAWKEYE-3-INITFAIL:%s failed to initialize - %s",
    "The token ring interface encountered an error while attempting to open a connection to the ring. The specific error that  occured is described in the last half of the error message as one of the following:  1 'microcode checksum failed' - the MAC microcode was found to be corrupted inside the interface's local memory.  2 'failed to build receive descriptor ring' -  there was not enough system memory available to  allocate receive buffers for packets.  3 'init failed' - the interface hardware rejected the device driver's request to configure and open the interface."
   ],
   1
  ],
  0.8056119084358215
 ],
 [
  [
   [
    "GDOI-5-COOP_KS_BLOCK_NEW_GM_REGISTER_ELECTION:This KS temporarily blocks GM with ip-addr %s from registering in group %s as the KS election is underway",
    "classifier is already applied but we cannot update the classifier with changed destination IP address or source IP address because of errors. So we put the classifier into conflict state."
   ],
   0
  ],
  0.6715732216835022
 ],
 [
  [
   [
    "CLI_AGENT-3-FILE_OPEN:Failed to open %s: %s",
    "Failed to load external configuration command set"
   ],
   1
  ],
  0.7287259101867676
 ],
 [
  [
   [
    "FMANRP_QOS-4-QOSUBR:qos can not be attached to the target with UBR configured",
    "An error occured to attach qos to ATM VC/VP target with UBR configured"
   ],
   1
  ],
  0.7010332345962524
 ],
 [
  [
   [
    "GK-3-PROC_MSGCB_NOMEM:\\ No memory for IPC message control block. Gatekeeper bringup failed.",
    "An attempt to move a data entry from one wavl tree to another wavl tree failed"
   ],
   0
  ],
  0.659429132938385
 ],
 [
  [
   [
    "FMANRP_NAT66-3-EINVAL:NULL",
    "An unexpected input value to a function was incorrect"
   ],
   1
  ],
  0.683601975440979
 ],
 [
  [
   [
    "GLBP-6-STATECHANGE:%s Grp %u state %s -> %s",
    "RPL Owner node detects a No Request R-APS message with the RPL Blocked status flag set and the Node Id differs from its own. This is a Failure of Protocol - Provision Mismatch due to a misconfiguration where there are multiple RPL Owner nodes configured in the ring."
   ],
   0
  ],
  0.5998114347457886
 ],
 [
  [
   [
    "CCH323-3-CANNOT_CREATE_CCB:%s: cannot create the H.323 ccb Tree",
    "Next Hop Client changed the state."
   ],
   0
  ],
  0.6689084768295288
 ],
 [
  [
   [
    "DIAG-3-INVALID_PORT:Invalid port number : %s",
    "An internal software error occurred."
   ],
   0
  ],
  0.7216401100158691
 ],
 [
  [
   [
    "DOMAIN-5-TCA:%s Received. Details: %s\\n",
    "A major error was detected during diagnostic testing."
   ],
   0
  ],
  0.6865617632865906
 ],
 [
  [
   [
    "ETHER_SERVICE_IPC-3-NOMEM:Unable to allocate memory for Ethernet Service on %s.",
    "This is an internal error"
   ],
   1
  ],
  0.7234160304069519
 ],
 [
  [
   [
    "DEREG_FAIL-3-MPLS_TE_EXT_FWDG:deregistration for pib=%d failed %d",
    "An unexpected condition has occurred which is due to the absence of a subblock structure on interface."
   ],
   0
  ],
  0.6825392246246338
 ],
 [
  [
   [
    "BGP_LMM-3-LSD1:%s %s",
    "The card enviromental parameters specified are outside the normalrange of operation."
   ],
   0
  ],
  0.7366620898246765
 ],
 [
  [
   [
    "BGP-6-NOT_SUPPORTED_NEXTHOP:V6 nexthop not supported for afi/safi %d/%d",
    "Internal use only"
   ],
   0
  ],
  0.695800244808197
 ],
 [
  [
   [
    "DIAG-3-GET_ARGU_FAIL:Get argument failed",
    "Repeated attempts to walk the list failed."
   ],
   0
  ],
  0.7715074419975281
 ],
 [
  [
   [
    "HPI-3-INVALID_PAYLOAD:wrong payload size channel:%s DSP ID:0x%x failed mode %d for service %d",
    "This is a notice about the High Availablility System mode."
   ],
   0
  ],
  0.8615655303001404
 ],
 [
  [
   [
    "CTS_PD-3-IPC_NORES:CTS-No space for the IPC reply size %u request %u",
    "Cisco Signature not found or invalid."
   ],
   0
  ],
  0.6216230392456055
 ],
 [
  [
   [
    "DSMIB-3-XMIT_MSG:%s",
    "Repeated attempts to reset the flags failed."
   ],
   0
  ],
  0.6676825284957886
 ],
 [
  [
   [
    "ESS_IPSUB-3-ESS_IPSUB_STUB:CPP ESS IPSUB executes stub entry in %s direction",
    "An internal error occured when looking up set statistics."
   ],
   0
  ],
  0.853435754776001
 ],
 [
  [
   [
    "CSG-6-RELOADOK:CSG ACCOUNTING %s reload on module %d successful",
    "Software error may have effected programming ACLs into the TCAM."
   ],
   0
  ],
  0.7244377136230469
 ],
 [
  [
   [
    "HA_CONFIG_SYNC-3-CONFREG:Cannot communicate config register to standby",
    "An internal software error occurred."
   ],
   0
  ],
  0.794443666934967
 ],
 [
  [
   [
    "HA_EM-3-FMPD_CLI_CONNECT:Unable to establish CLI session: %s",
    "An EHSA error occurred. The details about what was attempted and what went wrong will be printed."
   ],
   0
  ],
  0.672252357006073
 ],
 [
  [
   [
    "GDOI-3-COOP_CONFIG_MISMATCH:WARNING: Group %s %s configuration between Primary KS and Secondary KS are mismatched",
    "The configuration between Primary KS and Secondary KS are mismatched"
   ],
   1
  ],
  0.7288511395454407
 ],
 [
  [
   [
    "AUTOSEC-3-CONFSAVE_FAIL:Applying AutoSecure config to running-conf failed with error %d",
    "Configuration of the AutoSecure session could not be applied to the running configuration"
   ],
   1
  ],
  0.8913222551345825
 ],
 [
  [
   [
    "FR_VCB-3-BUMPING:Bumping error - vcb %s - %s",
    "An error occurred while bumping traffic in a vc-bundle"
   ],
   1
  ],
  0.5814335942268372
 ],
 [
  [
   [
    "C542-1-TOOBIG:%s packetsize %d too big.",
    "Error initializing the DSP with the application/overlay firmware."
   ],
   1
  ],
  0.6865481734275818
 ],
 [
  [
   [
    "GPRSFLTMG-0-NOPROCESS:\\ %s",
    "A Process could not be started"
   ],
   1
  ],
  0.6657915115356445
 ],
 [
  [
   [
    "CSM_SLB-4-WARNING:Module %d warning: %s",
    "The alarm appears when the processor has failed the  online diagnostic internal PCI bus test."
   ],
   0
  ],
  0.5595309138298035
 ],
 [
  [
   [
    "FCPA-3-RXEOPERR:EOP not set for port = %d conn = %s pps = %d rmd = 0x%x\\n",
    "The FCPA driver detected that end-of-particle was not set by wormhole"
   ],
   1
  ],
  0.5115101933479309
 ],
 [
  [
   [
    "DSC_ENV-2-NORMAL:Slot %d %s %s %u %s",
    "More information on the CCB semaphore. The tracebacks indicate the program counters and stack that point to the code that was the last to acquire this semaphore and the last to release this semaphore respectively"
   ],
   0
  ],
  0.5713507533073425
 ],
 [
  [
   [
    "CABLE_UTIL-4-DC_INVOKE_ERR:Dynamic Command %s invoke failure",
    "IPSec detected a serious internal error"
   ],
   0
  ],
  0.7780988812446594
 ],
 [
  [
   [
    "FTSP-4-HARDWARE_ERROR:tty %d",
    "An internal error has occured."
   ],
   0
  ],
  0.7028703689575195
 ],
 [
  [
   [
    "DSPFARM-4-NOTICE:Failure on DSPFARM module %s\\n",
    "CF related error"
   ],
   0
  ],
  0.7233598232269287
 ],
 [
  [
   [
    "IDTATM25-3-FAILTEARDOWNVC:Interface %s Failed to down vc %d Cause: %s",
    "The System Controller initialization status could not be properly obtained."
   ],
   0
  ],
  0.6872825026512146
 ],
 [
  [
   [
    "CCH323-3-BAD_IP_ADDRESS:%s: illegal destination %s",
    "This error means a process sent an illegal message."
   ],
   0
  ],
  0.7157819271087646
 ],
 [
  [
   [
    "FMANRP_QOS-3-CLPOLFAIL:No support for client policy with policing in class-default and marking in custom class",
    "An internal error occured during installing qos policy."
   ],
   1
  ],
  0.6239000558853149
 ],
 [
  [
   [
    "FWALL_PROXY-3-PROXY_DEBUG_REG_FAILED:%d",
    "FW Conditional Debugging registration failed."
   ],
   1
  ],
  0.7491488456726074
 ],
 [
  [
   [
    "DSPFARM-4-INFO:Info on DSPFARM module %s\\n",
    "Authorization was unsuccessful."
   ],
   0
  ],
  0.6845729947090149
 ],
 [
  [
   [
    "CI-3-ASPREV:***WARNING*** Hot swapping the ASP will cause hardware damage. \\n",
    "Consoleless access mgmt interface successfully configuredor its original configuration successfully restored"
   ],
   0
  ],
  0.6631639003753662
 ],
 [
  [
   [
    "EDSP-6-VEC_CHANGE:EDSP0's LES switching vector set to %s",
    "COMMON_MFIB_INTERNAL_ERROR"
   ],
   0
  ],
  0.6771116256713867
 ],
 [
  [
   [
    "GDOI-3-PSEUDO_TIME_LARGE:Pseudotime difference between KS %d sec and GM %d sec is larger than expected in group %s. Adjust to new PST",
    "Unable to get slotid"
   ],
   0
  ],
  0.7949241399765015
 ],
 [
  [
   [
    "AAAA-3-RELOGIN:sanity check in re-login %s to %s",
    "The event detector has exceeded its maximum number of retries to send a pulse to the embedded event manager to notify of an event publish."
   ],
   0
  ],
  0.6870856285095215
 ],
 [
  [
   [
    "GDOI-3-KS_NO_SID_AVAILABLE:GMs for group %s need SIDs but this KS has no KS SIDs configured or no more SIDs available.",
    "bgp scan-time configuration less than 15 seconds can cause high cpu usage by BGP Scanner."
   ],
   0
  ],
  0.6610168814659119
 ],
 [
  [
   [
    "IDBMAN-4-REMOVED_NONDEFAULT_CONFIG:Removed non default configuration for interfaces in slot %d",
    "In SSO mode the non-default configuration for any removed linecard is not synced to the standby during the bulk sync and it is removed from the configuration to avoid a config mismatch between active and standby supervisors."
   ],
   1
  ],
  0.7378592491149902
 ],
 [
  [
   [
    "HCCP-5-CHANOFF:HCCP %s Mbr %d %s: turning off channel.",
    "This message provides the reason of failure when a database transfer has failed."
   ],
   0
  ],
  0.674314022064209
 ],
 [
  [
   [
    "DSCC4-3-TOOBIG:DSCC4%d/%d packet size %d too big",
    "A packet greater than the assigned MTU of this serial interface  was queued up for transmission."
   ],
   1
  ],
  0.7247536778450012
 ],
 [
  [
   [
    "APS-6-CHNLACTIVE:Group %s - %s channel is now ACTIVE",
    "This message is posted when a previously standby  channel becomes the active channel. This is  informational only."
   ],
   1
  ],
  0.7204519510269165
 ],
 [
  [
   [
    "CHKPT-4-FREE_BUFFER:Checkpointing %d failed to free buffer",
    "Checkpointing failed to free a buffer. This may cause leak in memory resources."
   ],
   1
  ],
  0.7310778498649597
 ],
 [
  [
   [
    "ARP-3-STCKYARPOVR:Attempt to overwrite Sticky ARP entry: %i hw: %e by hw: %e\\n",
    "An unexpected condition has occurred in processing AAA request/reply message causing AAA handling failure."
   ],
   0
  ],
  0.8355695009231567
 ],
 [
  [
   [
    "FMANRP_QOS-4-QIDGENFAIL:qid generation failed reverting to default",
    "Ethernet cfm mep has exited AIS defect condition. This is due to not receiving ETH-AIS or ETH-LCK frames for expiry threshold or mep up state if LOC error happened before. Id refers to local mep vlan id or bridge-domain id."
   ],
   0
  ],
  0.6223136186599731
 ],
 [
  [
   [
    "DSCREDCLK-3-BTAKEOVER:Active DSC requests backup to takeover clock - done",
    "The other DSC has requested the current DSC to take over active \\ clock management \\ and the current DSC has done so."
   ],
   1
  ],
  0.7958828210830688
 ],
 [
  [
   [
    "CLNS-3-TENT:%s%s: %s",
    "An internal error occurred in the Intermediate System-to-Intermediate System ISIS"
   ],
   1
  ],
  0.6904376149177551
 ],
 [
  [
   [
    "CLUE-3-INVALID_AREA:Either address %#x or size %d reserved for CLUE storage area is invalid",
    "ALL FIB subblocks must be ISSU aware. The subblock code must be rewritten for ISSU. Otherwise this may lead to unpredictable behaviour when running in SSO mode with two different versions of IOS."
   ],
   0
  ],
  0.7506229877471924
 ],
 [
  [
   [
    "FASTBLK-4-WARNING:Unexpected condition: %s",
    "The system will wait for the user to confirm that they wish to keep what they've configured until the timer expires. If the confirmation is not received in time the router will rollback."
   ],
   0
  ],
  0.6726973056793213
 ],
 [
  [
   [
    "DSA_PROXY-3-PROXY_UNINIT_FAILED:Blank - Please provide info",
    "UNINIT cleanup failed."
   ],
   1
  ],
  0.7792074680328369
 ],
 [
  [
   [
    "DRMI-3-ISSU_XMIT:Client id:%d xmit failed error:%d",
    "ERM Framework is experiencing Errors when performing  ISSU Transformation during a transmit operation"
   ],
   1
  ],
  0.6816262602806091
 ],
 [
  [
   [
    "CI-1-NOFORK:Couldn't start environment polling daemon",
    "System initialization failed to start the task that monitors the internal chassis environment. This is probably due to a low-memory condition. System operation is continuing without environment polling. This problem demands immediate attention because it could allow damaging conditions such as overtemperature to go undetected."
   ],
   1
  ],
  0.6569608449935913
 ],
 [
  [
   [
    "DBUS-3-ORFS_NOTINITIALIZED:ORFS is not initialized",
    "When oir-remove-failing-slot is invoked the software attempts to initialize parameters. This initialization failed and the service will not be available."
   ],
   1
  ],
  0.7146021723747253
 ],
 [
  [
   [
    "HA_EM-3-FMS_SWITCH_NOT_RF_ACTIVE:%s: This processor is not in ACTIVE state state = %d. Switchover must be performed on ACTIVE processor.",
    "Switchovers must occur on ACTIVE unit not STANDBY unit."
   ],
   1
  ],
  0.6826648116111755
 ],
 [
  [
   [
    "HA-5-MODE:Operating mode is %s %smode is %s.",
    "This is a notice about the High Availablility System mode."
   ],
   1
  ],
  0.8620001673698425
 ],
 [
  [
   [
    "IGMP_SNOOP_ISSU-2-INIT:IGMP Snooping ISSU client initialization failed to %s. Error: %d %s",
    "All voice cards participated in DSPFarm must have the same echo canceller type"
   ],
   0
  ],
  0.7295736074447632
 ],
 [
  [
   [
    "HA-4-CHKPT:Platform CF - %s",
    "Failure in some UNIX checkpointing activity."
   ],
   1
  ],
  0.9125056862831116
 ],
 [
  [
   [
    "COMMON_FIB-3-FIBIDB_DB_MEM:%s chunk pool could not be %s. Possible memory leak.",
    "COMMON_FIB_INTERNAL_ERROR"
   ],
   1
  ],
  0.8325687646865845
 ],
 [
  [
   [
    "CTS-3-SXP_MSG_PARSE:Connection %s<%i %i> %s",
    "An error occurred while parsing SXP message."
   ],
   1
  ],
  0.6117299795150757
 ],
 [
  [
   [
    "AAA-3-BADMETHOD:Cannot process %s method %u",
    "This message indicates that Timer Wheel initialization is failed in the FW subsystem"
   ],
   0
  ],
  0.7405259013175964
 ],
 [
  [
   [
    "CLIENT_CLOCK_SYNC-3-PORTCREATE:cannot create port %s due to %s",
    "An internal software error occurred."
   ],
   1
  ],
  0.6967423558235168
 ],
 [
  [
   [
    "I82545-1-BAD_POOL:Could not init buffer pools",
    "The driver failed to get a pool of buffers from IOS"
   ],
   1
  ],
  0.6437111496925354
 ],
 [
  [
   [
    "FM-3-MERGEFAIL:%s ACL merge error %d %s on %s label %d",
    "An invalid transaction ID of for the indicated transaction type was encountered"
   ],
   0
  ],
  0.7054577469825745
 ],
 [
  [
   [
    "FM-2-VACL_FAILURE:Interface %s traffic will not comply with VACLs in %s directions",
    "VACLs will not be applied on traffic for this interface due to TCAM resource contention."
   ],
   1
  ],
  0.5223835706710815
 ],
 [
  [
   [
    "APPFW-6-IM_AOL_CLIENT_VERSION:im-aol %i:%d attempting to establish connection with aol server %i:%d using an unsupported version of the client",
    "The AOL client version is not supported"
   ],
   1
  ],
  0.6838259100914001
 ],
 [
  [
   [
    "DSX1-3-M32_BAD_BITRATE:Munich 32 bit rate not match: Ctrl = 0x%08x Channel = %d",
    "SASL component initialization failed."
   ],
   0
  ],
  0.6811819076538086
 ],
 [
  [
   [
    "GK-3-GK_SRV_LISTEN_FAIL:\\ Failed to open Gatekeeper Server listening socket.",
    "Error encounterd during TCA processing. The flow could not be placed on alternate path."
   ],
   0
  ],
  0.7525692582130432
 ],
 [
  [
   [
    "AAAA-4-SERVNORADIUS:The server-group \\%s\\ is not a radius server group.  define \\%s\\ as a radius server group.",
    "License contract violation! License Restricted/Enforced"
   ],
   0
  ],
  0.5229662656784058
 ],
 [
  [
   [
    "ESCON-3-IDPROM_ACCESS_FAIL:Access to IDPROM Failed",
    "This message indicates that the number of dynamically learned ARP entries has reached a preconfigured max. limit in ARP Table."
   ],
   0
  ],
  0.6930633783340454
 ],
 [
  [
   [
    "FMANRP_NAT-3-IPSTATICROUTETYPE:Received ip static route message from data path with unsupported address type",
    "An unrecoverable software error occurred while trying to merge the configured input features."
   ],
   0
  ],
  0.7344621419906616
 ],
 [
  [
   [
    "FILESYS-5-IFLASH:Internal Flash %s %s",
    "could not obtain or coalesce packet buffer"
   ],
   0
  ],
  0.6074656844139099
 ],
 [
  [
   [
    "FMANRP_SSLVPN-3-AAATDLERR:%s%s. %s",
    "An unexpected condition has occurred in processing AAA request/reply message causing AAA handling failure."
   ],
   1
  ],
  0.7619451880455017
 ],
 [
  [
   [
    "HARDWARE-3-ASICNUM_ERROR:Port-ASIC number %d is invalid",
    "Each Port-ASIC is identified by an ID.The port ASIC number used is invalid and this is aninternal error"
   ],
   1
  ],
  0.6215493083000183
 ],
 [
  [
   [
    "CASA-4-BADMSG:Message parsing error: %s",
    "Failed to parse an incoming packet"
   ],
   1
  ],
  0.7006357908248901
 ],
 [
  [
   [
    "ASR900IM-3-UNSUPPORTED:This Interface Module is not supported in subslot %d",
    "An internal software error has occurred in ARP subsystem an NULL arp entry is got."
   ],
   0
  ],
  0.5162239074707031
 ],
 [
  [
   [
    "CTS-6-IFC_DISCONNECT_STATE:Interface Controller in DISCONNECT state for int%s",
    "The user has put T1 and E1 8PRI DFC cards in the same chassis."
   ],
   0
  ],
  0.8053658604621887
 ],
 [
  [
   [
    "CE3-2-NOVC:%s: packet received for unknown VC %d",
    "The specified FPGA chip showed incorrect status after downloading  its control microcode. This is probably caused by a hardware failure. It is a fatal condition for the system and will be followed by a core dump."
   ],
   0
  ],
  0.6804531812667847
 ],
 [
  [
   [
    "CRYPTO-6-PRNG_SEED_KEY_ERROR:Pseudo-random number generator seed and seed key was identical",
    "Sending Unicast Rekey"
   ],
   0
  ],
  0.798258364200592
 ],
 [
  [
   [
    "CISCO_STUN-3-QUEUE_ERROR:Unable to enqueue event %s %d to a process watched queue. Current size: %d max size: %d",
    "An internal or external event was dropped because it could not be added to the queue probably because the queue is full. The result may be minor retransmission of a STUN message or major dropped call depending on the event which was lost. This error may indicate that the call rate is exceeding the capacity of the gateway. If this is the case the CPU utilization will be excessively high above 75%."
   ],
   1
  ],
  0.6919950842857361
 ],
 [
  [
   [
    "BACKUP_INTERFACE-5-PREEMPT:Preempting interface %s in backup pair %s %s preemption mode is %s",
    "System initialization failed to start the task that monitors the internal chassis environment. This is probably due to a low-memory condition. System operation is continuing without environment polling. This problem demands immediate attention because it could allow damaging conditions such as overtemperature to go undetected."
   ],
   0
  ],
  0.8755870461463928
 ],
 [
  [
   [
    "FCPA-3-POSTERR:%s POST failed..!\\n",
    "The FCPA power on self test failed due to hardware error."
   ],
   1
  ],
  0.7852357029914856
 ],
 [
  [
   [
    "GK-3-NO_DISC_PORT:\\ Unable to open or bind to gatekeeper discovery port. Bringup failed.",
    "COMMON_FIB_INTERNAL_ERROR"
   ],
   0
  ],
  0.6845729947090149
 ],
 [
  [
   [
    "FECPM-3-TXCOMPNOTIFY:On int %d/%d tx_comp_notify vector is not set",
    "An internal software error occurred."
   ],
   1
  ],
  0.6543523073196411
 ],
 [
  [
   [
    "COMMON_MFIB-3-MFIBISSU_REGISTRATION:Unable to register %s ISSU client%u.",
    "An internal software error occurred."
   ],
   0
  ],
  0.7010514140129089
 ],
 [
  [
   [
    "FIB-4-FIBCBLK:Missing cef table for tableid %d during %s event",
    "IPV4FIB_INTERNAL_ERROR"
   ],
   1
  ],
  0.7383944392204285
 ],
 [
  [
   [
    "CFC_STATS-3- STATSNOMEM:CFC Stats failed to allocate memory during %s creation.",
    "Internal coding error."
   ],
   0
  ],
  0.7175924181938171
 ],
 [
  [
   [
    "AUTORP-4-OVERLAP:AutoRP %s packet group %i with mask %i removed because of multicast boundary for %i with mask %i",
    "Global dot1x is not enabled and hence CTS will not run"
   ],
   0
  ],
  0.8565515875816345
 ],
 [
  [
   [
    "FTPSERVER-6-TOPDIRTEST:Input path failed Top-dir%s test.",
    "COMMON_FIB_INTERNAL_ERROR"
   ],
   0
  ],
  0.7017369866371155
 ],
 [
  [
   [
    "DSPDUMP-5-TX_CONTROL_DROP:DSP %d in slot %d Tx Control Message Dropped by DSP",
    "The DSP has reported that a Tx Control Message was dropped"
   ],
   1
  ],
  0.6549661159515381
 ],
 [
  [
   [
    "CCH323-3-CANNOT_ALLOCATE_GW:%s: cannot allocate gateway structure",
    "Error on DNLD module."
   ],
   0
  ],
  0.6562911868095398
 ],
 [
  [
   [
    "EPM-6-ACL_CONFIG_ERROR:ACL NAME '%s' | ACE SEQUENCE %ld | RESULT FAILURE | REASON '%s'",
    "This message indicates that adding an ACE to the specified ACL was ignored because of wrong configuration"
   ],
   1
  ],
  0.7949241399765015
 ],
 [
  [
   [
    "HMM_ASYNC-3-MODEM_FAILED_DIAGS:Digital modem %d/%d on Simm %d failed power on diagnostics.",
    "Digital modem failed to pass power on diagnostics. It will not be used."
   ],
   1
  ],
  0.8714786767959595
 ],
 [
  [
   [
    "IEDGE-3-CH_REGISTER_ERROR:CoA registration error in command processing - type '%s'",
    "There has been an internal error relating to CoA command processing."
   ],
   1
  ],
  0.657086193561554
 ],
 [
  [
   [
    "DOMAIN-5-TC_PATH_CHG:Traffic class Path Changed. Details: %s\\n",
    "A Path chage is made."
   ],
   1
  ],
  0.6316092014312744
 ],
 [
  [
   [
    "CARD_STATE-4-FORCE_RESET:Reset slot %u for reason: %s",
    "The SUP forced a linecard to reload for the reason."
   ],
   1
  ],
  0.839848518371582
 ],
 [
  [
   [
    "GK-3-SHUTDOWN_WITH_CALLS:\\ Cannot shutdown gatekeeper because there are calls in progress.",
    "An internal error has occured."
   ],
   1
  ],
  0.7410237193107605
 ],
 [
  [
   [
    "HCCP-5-BULKSYNCINCOMP:Grp %d Mbr %d %s: During PRE bulk syncing ignore LC failover.",
    "Ignore LC failover event when active PRE is syncing data to standby PRE."
   ],
   1
  ],
  0.7372755408287048
 ],
 [
  [
   [
    "ECFM_HSBY-5-SUSPEND:Remote ODU for link protection group %d on %s is now suspended.",
    "SXP binding update error."
   ],
   0
  ],
  0.6097711324691772
 ],
 [
  [
   [
    "BGP-6-ATTR_WRONG_LEN:BGP update error: %s Wrong length %d for %s dropped by error handling",
    "The remote BGP peer sent in a route with an invalid optional transitive attribute."
   ],
   1
  ],
  0.7382937073707581
 ],
 [
  [
   [
    "COMMON_FIB-3-FIBXDRINV:Invalid XDR format. %s",
    "An internal error has occured."
   ],
   0
  ],
  0.6647035479545593
 ],
 [
  [
   [
    "ATMPA-3-CMDFAIL:%s Command Failed at %s - line %d arg %d",
    "An internal software error occurred. This is probably because not enough memory was available."
   ],
   0
  ],
  0.7167108058929443
 ],
 [
  [
   [
    "AAA-5-USER_RESET:User %s failed attempts reset by %s",
    "All upgrade operations have not completed and additional power-cycle operations are required before the upgraded or new FPD image will be applied to the system configuration. The message text indicates the number of pending upgrade operations that will be performed. More than one power-cycle operation might be required to complete the overall upgrade process."
   ],
   0
  ],
  0.7279966473579407
 ],
 [
  [
   [
    "FRR_OCE-3-INVALID_ADDRTYPE:addrtype to xdr: %d %d",
    "An internal software error occurred."
   ],
   1
  ],
  0.6840338706970215
 ],
 [
  [
   [
    "CCH323-3-MAXIMUM_INTERNAL_EVENT_BUFFERS_EXCEED:%s: Exceeding limit on allocating internal event buffers",
    "Firewall High Availability could not register as a Checkpoint Facility client"
   ],
   0
  ],
  0.7648700475692749
 ],
 [
  [
   [
    "FR-3-NOMEMORY:No memory for %s",
    "LRC access Failed"
   ],
   0
  ],
  0.7987436652183533
 ],
 [
  [
   [
    "FDDI-3-BADUNIT:msgtxt_badunit",
    "This error message is displayed when the system cannot find the chipset registers where it expects them to be. This is most likely a hardware error."
   ],
   1
  ],
  0.6734341382980347
 ],
 [
  [
   [
    "DYNCMD-3-LINKINVALIDTRANS:Link transition '%s' message received for node '%s' which cannot have such a transition.",
    "A NHRP Resolution Request has timed-out"
   ],
   0
  ],
  0.6910216808319092
 ],
 [
  [
   [
    "CLS-3-BOGUSOP:Unknown CLS verb for %s context DlcOpcodeT=%04x",
    "A bad opcode was generated by the DLC for the STN or CEP."
   ],
   1
  ],
  0.933462381362915
 ],
 [
  [
   [
    "CFGD_LBL_REGION-4-LCON:Adjusting configured label range to default range",
    "The saved configuration has been ignored and the default label range is being used."
   ],
   1
  ],
  0.808139979839325
 ],
 [
  [
   [
    "FASTHELLO-5-FH_UP:Fast-Hello interface %s status changed to link up\\n",
    "ERSPAN Initialization of packet replication registration failed."
   ],
   0
  ],
  0.7932435870170593
 ],
 [
  [
   [
    "CTS-3-MODE_LIST_CKSUM_ERROR:CTS SAP mode-list checksum failure on interface %s.\\n",
    "CTS SAP mode-list checksum failure has been detected on this interafce which could provide crypto services. This event may be caused by memory corruption occuring in the interface configutration or the memory area has been illegally modified. It may also be caused by software defects. As a result of this event the system has been forced to reload."
   ],
   1
  ],
  0.690490186214447
 ],
 [
  [
   [
    "ECC-3-SBE_LIMIT:Single bit error detected and corrected\\nat 0x%08x",
    "A single-bit correctable error was detected on a CPU read from DRAM."
   ],
   1
  ],
  0.8075392842292786
 ],
 [
  [
   [
    "AAAA-3-NOSG:No server-group passed through parser.",
    "COMMON_FIB_INTERNAL_ERROR"
   ],
   0
  ],
  0.6706233620643616
 ],
 [
  [
   [
    "FM-4-ACES_EXCEEDED:Interface %s traffic will be software switched in %s directions",
    "The number of ACEs exceeded the maximum number that could be supported by the system. Instead a bridge result had been applied for the acl."
   ],
   1
  ],
  0.7488565444946289
 ],
 [
  [
   [
    "DLINK-3-NULL_QELEM:Null queue elem",
    "An internal software error occurred."
   ],
   1
  ],
  0.7069092392921448
 ],
 [
  [
   [
    "DSG-3-DSG_DA_TO_DSID_DUPLICATED:DA %e to DSID table duplicated when operation %s DSID %X on interface %s/%d.",
    "DSG DA_TO_DSID table in LC should be unique for DA on a interface."
   ],
   1
  ],
  0.7981975674629211
 ],
 [
  [
   [
    "FPD_MGMT-3-SW_ERROR:NULL",
    "FPD_INTERNAL_SW_ERR_STD_EXPLANATION"
   ],
   1
  ],
  0.8205494284629822
 ],
 [
  [
   [
    "ETHERNET_LACP-4-ISSU_XFORM:\\n%s: failed rc=%s",
    "The ISSU transform has failed. This is an informational message only."
   ],
   1
  ],
  0.7350279092788696
 ],
 [
  [
   [
    "CTS-6-AUTHZ_SM_STOP:Policy Installation state machine stopped for int%s peer%s",
    "No valid ANN message has been received in this secondary KS for a prolong period. Temporarily blocking new GM registrations until a valid ANN is received"
   ],
   0
  ],
  0.6571553945541382
 ],
 [
  [
   [
    "FWALL_PROXY-3-PROXY_HSL_MODIFY_FAILED:Blank - Please provide info",
    "Waiting for policy acquisition"
   ],
   0
  ],
  0.626500129699707
 ],
 [
  [
   [
    "CTS-5-DOT1X_INIT_FAILED:Failed to initialize dot1x for int%s",
    "An error occcured while CTS attempts to initialize dot1x for a CTS link"
   ],
   1
  ],
  0.7294502854347229
 ],
 [
  [
   [
    "CTS-3-AUTHZ_POLICY_FAIL_TO_REMOVE:Failed to remove %s policy from the authorization dbase",
    "The IP options list contains one or more options that perform various network management or debugging tasks. This alarm may indicate a reconnaissance attack is in progress against your network."
   ],
   0
  ],
  0.6796320080757141
 ],
 [
  [
   [
    "AP-5-WEBAUTH_START:Starting %s for HOST IP %s MAC %e AuditSessionID %s on Interaface %s",
    "A packet was received for the wrong version of CASA"
   ],
   0
  ],
  0.8148393630981445
 ],
 [
  [
   [
    "HMM_ASYNC-3-TDM_SYNTHESIS_ERROR:HMM Digital Modem Card %d experienced a TDM Synthesis Error.",
    "Digital Modem Card failed to send or receive PCM data in time to avoid data loss. This may cause the modems to speed shift retrain or hangup."
   ],
   1
  ],
  0.7242742776870728
 ],
 [
  [
   [
    "CTS-7-CTS_ASSERT:Assertion Failure  %s @%s:%d  : %s",
    "CTS_INTERNAL_ERROR"
   ],
   1
  ],
  0.6737303137779236
 ],
 [
  [
   [
    "HA_TLV-2-LDP:Failed to convert to %s for %s",
    "LDP called a TLV intf which returned an error."
   ],
   1
  ],
  0.8556888699531555
 ],
 [
  [
   [
    "AT-3-DOMOVERFLOW:Remap range overflow for %s domain %d",
    "The remap range overflowed. If a network range cannot fit inside the remapping range the network or cable range being advertised by a neighboring router is not accepted. When an overflow occurs all interfaces in the domain are disabled."
   ],
   1
  ],
  0.6814667582511902
 ],
 [
  [
   [
    "AN-6-MASA_NOT_CONFIG:ANRA udi %s has no reachability to MASA -not configured Cant verify device udi %s",
    "The manufacturer authorised signing authority has not been configured cannot do the verification of device"
   ],
   1
  ],
  0.6687809824943542
 ],
 [
  [
   [
    "BSTUN-6-PEERSHUTDOWN:shutting down peer %s on %s",
    "Problems with manipulating the bgp neighbor route needed for MPLS operations"
   ],
   0
  ],
  0.8556888699531555
 ],
 [
  [
   [
    "AUTH_MGR_ISSU-3-NEAT_NOT_COMPATIBLE:NEAT is active in one of the ports and peer does not support NEAT",
    "Atleast one of the ports have a supplicant switch conected to it and ISSU cannot proceed since Standby does not support NEAT ports. Shut down the ports connected to the supplicant switches and retry ISSU."
   ],
   1
  ],
  0.6687809824943542
 ],
 [
  [
   [
    "IM_EEPROM-3-FORMAT_ERROR:%s: %s. The EEPROM might require an update.",
    "A format error has been detected in the EEPROM of the indicated IM. The type of error is indicated in the error message."
   ],
   1
  ],
  0.6416477560997009
 ],
 [
  [
   [
    "EXPRESS_SETUP-6-MODE_BUTTON_RESET_IGNORED:%s",
    "mode button pressed for more than 10Sec andstartup config is present hence not reloading"
   ],
   1
  ],
  0.8403676748275757
 ],
 [
  [
   [
    "FALLBACK-5-AVBO_PROBE:A probe to %i is %s - codec %s icpif %d loss %d delay %d",
    "This message indicates excessive traffic congestion on the ATM interface may have resulted in cell loss. The PCI-ATM interface's cell buffers were full when a cell arrived on the interface resulting in a receive freeze condition."
   ],
   0
  ],
  0.7161188721656799
 ],
 [
  [
   [
    "FM-3-GOTVLABEL:Got label for VLAN #%d",
    "The Feature Manager has now been able to allocate a hardware label for the VLAN. The VLAN had needed a label before but none was available."
   ],
   1
  ],
  0.584891676902771
 ],
 [
  [
   [
    "GE_LINK-3-MDIO_ERR:%s error for controller %d port %d",
    "Error in accessing GigE Transceiver"
   ],
   1
  ],
  0.6797994375228882
 ],
 [
  [
   [
    "AT-3-SUBROUTINE_ERROR:AppleTalk error: %s",
    "A function failed to allocate data."
   ],
   0
  ],
  0.7469728589057922
 ],
 [
  [
   [
    "BRIMUX-3-BADDLACK:Slot %d BRIC failed to acknowledge download data block %d",
    "First DTI error message"
   ],
   0
  ],
  0.816672682762146
 ],
 [
  [
   [
    "GEFC-3-INT_LPBK_FAIL:Internal CardLoopback Failed",
    "The environmental monitor detected a voltage has returned to normal operating range."
   ],
   0
  ],
  0.7031287550926208
 ],
 [
  [
   [
    "AP-5-AP_AAA_DOWN:Event=AAA %s. HOST %i| POLICY %s %s | AuditSessionID %s",
    "Submit An alarm - Let MIB prints out the message"
   ],
   0
  ],
  0.7406237125396729
 ],
 [
  [
   [
    "DSG-5-CFR_NOT_APPLIED:classifier <%s> cannot be applied because of errors",
    "The device classifier did not find the default profile file or it may  be corrupted. DC is working using built-in profiles."
   ],
   0
  ],
  0.6378483176231384
 ],
 [
  [
   [
    "BFD_TEST-3-BAD_TYPE:Invalid session type %d",
    "An internal error occured when looking up account statistics."
   ],
   0
  ],
  0.5094483494758606
 ],
 [
  [
   [
    "CHKPT-3-ILLEGAL:ILLEGAL call to CF API by client %d on the %s system",
    "An internal software error occurred."
   ],
   0
  ],
  0.6969889402389526
 ],
 [
  [
   [
    "COMMON_FIB-3-ISSU_REG:ISSU client %s %d entity %d failed ISSU registration: %s",
    "ISSU negotiation failed for this XDR client."
   ],
   1
  ],
  0.6807181239128113
 ],
 [
  [
   [
    "EM-3-EXCEED:EM exceed maximum open events %d.",
    "Currently the router has the CRYPTO IPSEC OPTIONAL ENABLE setting which allows data which normally would be encrypted to be sent in the clear."
   ],
   0
  ],
  0.6131585240364075
 ],
 [
  [
   [
    "CBUS-3-POTSTAT:Out of buffers--losing status information for POTENT on VIP card",
    "This is a notice message about a High Availability System syncronization status condition or event. The syncronization operation failed."
   ],
   0
  ],
  0.8520739078521729
 ],
 [
  [
   [
    "CBUS-3-CTRINIT:Interface %s CTR Initialization Failed - %s",
    "The polling mechanism for an ALPS interface has become stuck."
   ],
   0
  ],
  0.6853857040405273
 ],
 [
  [
   [
    "BGP_MPLS-7-IASLABELALLOC:Failed to create rewrite prefix %s result %s",
    "BGP MPLS VPN rewrite creation failed."
   ],
   1
  ],
  0.7910641431808472
 ],
 [
  [
   [
    "COMMON_FIB-3-FIB_PATH_LIST_DB:%s path list %s",
    "Triggers when a IP datagram is received with the  ''protocol'' field of the IP header set to 1 ICMP and the ''type''  field in the ICMP header set to 11Time Exceeded for a Datagram. No known exploits incorporate this option."
   ],
   0
  ],
  0.6715205907821655
 ],
 [
  [
   [
    "HDV-3-DISCOVER:HDV in slot %d: the HDV failed to initialize properly.",
    "An initialization action failed for the HDV. This can be caused by a lack of system resources improper or no VIC installed in the port module or it may be bad HDV hardware."
   ],
   1
  ],
  0.5588845610618591
 ],
 [
  [
   [
    "AN-6-ACP_IPSEC_TO_NBR_REMOVED:Removed IPSEC tunnel %s to neighbor %s Tunnel state %d",
    "Terminal Access Controller Access Control System TACACS authentication failed because extended TACACS is not configured."
   ],
   0
  ],
  0.6927127838134766
 ],
 [
  [
   [
    "DSC_ENV-2-WARNING:Slot %d %s %u %s",
    "A addition to a cluster ID structure could not be completed because of an error."
   ],
   0
  ],
  0.6841726899147034
 ],
 [
  [
   [
    "DBUS-3-MSGOVERFLOW:Slot %d too many DBUS messages",
    "A board in the slot identified in the error message tried to send too many logger messages."
   ],
   1
  ],
  0.7639331817626953
 ],
 [
  [
   [
    "CRYPTO_HA_IKE-3-FAILOVER_ERROR:Attempt to failover IKE SA %i:%i failed due to %s. No stateful failover available for this SA.",
    "The HA Active device attempted to checkpoint the state of an IKE SA to the Standby but the Standby device was unable to create the Standby IKE SA."
   ],
   1
  ],
  0.6444684267044067
 ],
 [
  [
   [
    "ETHCNTR-3-LOOP_BACK_DETECTED:Loop-back detected on %s.",
    "Environment data download in start state"
   ],
   0
  ],
  0.7061648368835449
 ],
 [
  [
   [
    "FRR_OCE-3-INVALID_BFD_SESSION:BFD session db node mismatch: bfd context db node is %p frr db node is %p",
    "An internal software error occurred."
   ],
   1
  ],
  0.7990023493766785
 ],
 [
  [
   [
    "AAAA-3-NOFREELISTS:%% AAA: No free %s lists for \\%s\\",
    "You have reached the maximum number of possible authentication lists for this method."
   ],
   1
  ],
  0.7344621419906616
 ],
 [
  [
   [
    "HA_EM-4-FMFD_SNMP_NO_OBJECT_VALUE:%s: SNMP MIB object value not provided",
    "Each statistics supported by the Port-ASIC are identified using an ID. The ID provided by the caller is out of range"
   ],
   0
  ],
  0.7099962830543518
 ],
 [
  [
   [
    "DIALSHELF-2-DSCDOWN:DSC in slot %d changes state to down.",
    "DSC in dial shelf went down."
   ],
   1
  ],
  0.8285183906555176
 ],
 [
  [
   [
    "DHCPD-3-READ_ERROR:DHCP could not read bindings from %s.",
    "Standby CPU software subsystem is older or missing. See  message text for software subsystem type. May result in  feature losses in the event of a switchover."
   ],
   0
  ],
  0.6907612085342407
 ],
 [
  [
   [
    "CSM_VOICE-3-UNDEFVOICEINTRF:Invalid interface slot:controller:group%d/%d:%d",
    "The SCP process has been terminated."
   ],
   0
  ],
  0.8370420932769775
 ],
 [
  [
   [
    "DMTDSL-1-INITFAIL:DMTDSL%d/%d Init failed %s",
    "The ADSL network module hardware may be bad"
   ],
   1
  ],
  0.82750004529953
 ],
 [
  [
   [
    "BGP-3-ADDROUTE:Unable to add route for %s to radix trie",
    "An error occured during a file close operation."
   ],
   0
  ],
  0.6993799209594727
 ],
 [
  [
   [
    "COMMON_FIB-3- ISSU_ENUM_ERROR:Enum for %s is not ISSU-compliant: %s",
    "The given enumeration is not ISSU-compliant for the reason given. Unpredictable behaviour will result when interoperating with different IOS versions."
   ],
   1
  ],
  0.8116140961647034
 ],
 [
  [
   [
    "FDDI-3-NOCAM:Unit %d No CAM exists for this interface.",
    "A hardware or software error occurred."
   ],
   1
  ],
  0.6247696876525879
 ],
 [
  [
   [
    "COLLECTION-3-PROC_INIT:Initialization of process %s failed unable to %s",
    "COLLECTION_INTERNAL_ERROR"
   ],
   1
  ],
  0.7288511395454407
 ],
 [
  [
   [
    "DSX1-3-M32_BAD_BITRATE:Munich 32 bit rate not match: Ctrl = 0x%08x Channel = %d",
    "Command can not be carried out there is a mismatch on bit rate"
   ],
   1
  ],
  0.7127888202667236
 ],
 [
  [
   [
    "GENERAL-2-CRITEVENT:%s",
    "Critical error"
   ],
   1
  ],
  0.7407069206237793
 ],
 [
  [
   [
    "ECFM_HA-3- ISSU:YO",
    "Hi"
   ],
   1
  ],
  0.7281238436698914
 ],
 [
  [
   [
    "GEFC-3-KPA_TIMEOUT_ALM:Keep-alive timeout %s",
    "Normal packets/CDL Idle packets not received"
   ],
   1
  ],
  0.5610389709472656
 ],
 [
  [
   [
    "DSMIB-3-TIMER_START:%s",
    "Unable to create the specified watched boolean due to unknown reasons"
   ],
   0
  ],
  0.7836621403694153
 ],
 [
  [
   [
    "ATMPA-1-RPTFAIL:%s failed to send report %d at %s - line %d",
    "Autonomic network VRF has been created on the interface"
   ],
   0
  ],
  0.8062199950218201
 ],
 [
  [
   [
    "APPFW-4-HTTP_PORT_MISUSE_TUNNEL:Sig:%d HTTP Tunnel detected - %s %s from %i:%d to %i:%d",
    "IFC Entering SAP State"
   ],
   0
  ],
  0.70079106092453
 ],
 [
  [
   [
    "FASTHELLO-5-FH_UP:Fast-Hello interface %s status changed to link up\\n",
    "FASTHELLO STATUS CHANGED to UP with more detail status"
   ],
   1
  ],
  0.7154949903488159
 ],
 [
  [
   [
    "CCM-3-CCMNOCLIENT:Client %s[%d] not present",
    "Error during allocation/freeing of a label"
   ],
   0
  ],
  0.5394469499588013
 ],
 [
  [
   [
    "FIB-2-FIBDOWN:CEF has been disabled due to a low memory condition. It can be re-enabled by configuring \\ip cef [distributed]\\",
    "Received Rekey"
   ],
   0
  ],
  0.7463074922561646
 ],
 [
  [
   [
    "HP100VG-1-ACCESS:%s access to network denied",
    "AAL5 datapath has received a packet with invalid encap for packet typeDATA CNTL... Th packet is dropped. The error message contains text which can be used to help identify the nature of the problem."
   ],
   0
  ],
  0.6184753775596619
 ],
 [
  [
   [
    "CTS-3-SXP_CONN_STATE_CHG_OFF:Connection %s<%i %i>-%d state changed from %s to Off.",
    "COMMON_FIB_INTERNAL_ERROR"
   ],
   0
  ],
  0.6736155152320862
 ],
 [
  [
   [
    "ECFM_PROXY-3-ECFM_MEM_REQ_FAILED:ECFM IPC subtype: %d",
    "Requesting more memory failed."
   ],
   1
  ],
  0.6220919489860535
 ],
 [
  [
   [
    "AMDP2_FE-3-TOOMANYPART:Bad packet with %d particles pak=0x%x",
    "The software detected an invalid packet."
   ],
   1
  ],
  0.6529142260551453
 ],
 [
  [
   [
    "ENV_MON-6-INSPEM:PEM number %s inserted into slot %d",
    "The OIR facility detected the insertion of a PEM from slot [n]."
   ],
   1
  ],
  0.68952876329422
 ],
 [
  [
   [
    "CSM_VOICE-3-UNDEFDSX0:Undefined dsx0 interface for controller%d/%d",
    "An internal software error occurred."
   ],
   0
  ],
  0.6555097699165344
 ],
 [
  [
   [
    "CPPBQS-3-SRT_PERR_RESORT_FAIL:QFP %d unable to resort to correct parity error at SEID=%#X",
    "A QFP BQS SRT parity error occurred that was uncorrectable"
   ],
   1
  ],
  0.7925247550010681
 ],
 [
  [
   [
    "CIRRUS-3-BADMODE:Interface serial %d Bad mode encountered in init",
    "An internal software error occurred."
   ],
   1
  ],
  0.743314802646637
 ],
 [
  [
   [
    "CBR_SPA-3-CORTINA_PHY_DEV_INIT_ERROR:%s Cortina PHY device init error port %d/%d/%d",
    "Unable to downaload firmware to Cortina PHY device"
   ],
   1
  ],
  0.6805347204208374
 ],
 [
  [
   [
    "IDS-4-ICMP_SOURCEQUENCH_SIG:Sig:2002:ICMP Source Quench - from %i to %i",
    "The cache tree pointer is of null value."
   ],
   0
  ],
  0.6330899000167847
 ],
 [
  [
   [
    "CSM_VOICE-3-MALLOC:No memory is available to build any internal data  structure for the voice software.",
    "A trace that shows where the previous ALIGN error occurred."
   ],
   0
  ],
  0.659716010093689
 ],
 [
  [
   [
    "CRYPTO-3-MTREE_CMD_BLOCK:Mtree command %d was blocked from the the mtree process queue.",
    "An attempt was made to enqueue a command to the crypto mtree manager process even though IPsec is currently operating in HAPX mode."
   ],
   1
  ],
  0.7190848588943481
 ],
 [
  [
   [
    "AN-3-TLV_PARSE_ALIGN_ERROR:TLV parsed Len %d Next TLV could be misaligned",
    "Parsed TLV message is not a multiple of 4 and the next TLV message can be misaligned"
   ],
   1
  ],
  0.7383944392204285
 ],
 [
  [
   [
    "FILESYS-5-UNKNDEV:Unknown device %s %s",
    "A file system's status has changed. Follow any instructions provided with the message."
   ],
   1
  ],
  0.8011146783828735
 ],
 [
  [
   [
    "HA_EM-4-FMPD_IPC_GET_PAK:%s: failed to allocate an IPC buffer",
    "The requested external memory allocator failed to be initialized. Reasons are not clear."
   ],
   0
  ],
  0.6875791549682617
 ],
 [
  [
   [
    "DNLD-3-ERROR:%s",
    "Error on DNLD module."
   ],
   1
  ],
  0.656180202960968
 ],
 [
  [
   [
    "ESCON-3-MIB_LOCAL_FL_LASER_DOWN_ALM:Local Failure Laser Disabled %s %s %s",
    "Loss of Sync"
   ],
   0
  ],
  0.7221688032150269
 ],
 [
  [
   [
    "FME_DP-3-DEBUG_REG_FAILED:Flow Metric Engine fails to registrate with Conditional Debugging.",
    "There was a failure such that service controller bulk sync did not occur"
   ],
   1
  ],
  0.7768334746360779
 ],
 [
  [
   [
    "FIB-3-INVALIDSTATE:Slot %s in invalid transition from %s to %s",
    "The path to a network changed because either the old path went down or the new path was better."
   ],
   0
  ],
  0.7335065007209778
 ],
 [
  [
   [
    "DATA_DESCR-3-ENTRY_EXPIRED:Found expired message entry for descriptor %u-%u/%u/%u/%u",
    "ECI in pull state and ignores the incoming mesage from cli_agent"
   ],
   0
  ],
  0.6403384804725647
 ],
 [
  [
   [
    "ILPOWER-5-DET_TIMEOUT_SPARE_PAIR:Interface %s: spare pair detect timeout",
    "The remote DRP agent has not responded within the time period reported"
   ],
   0
  ],
  0.7743214964866638
 ],
 [
  [
   [
    "HPI-3-GSMAMRNB_LICENSE_NOT_ACTIVATED:\\n \\ \\nGSM AMR-NB License is not yet activated. \\ \\n configure 'license feature gsmamrnb-codec-pack' \\ \\nand accept the EULA to activate the license. \\ n",
    "Per CE label global keyid wrap trigger label reallocation"
   ],
   0
  ],
  0.7610092759132385
 ],
 [
  [
   [
    "HA-6-MODE:Operating RP redundancy mode is %s\\n",
    "Operational redundancy mode information"
   ],
   1
  ],
  0.5844228267669678
 ],
 [
  [
   [
    "ATOM_SEG-3-ILLEGALUPD:Illegal label %d update %s",
    "AToM Segment Handler error"
   ],
   1
  ],
  0.5916607975959778
 ],
 [
  [
   [
    "CBUS-3-FCICMDFAIL0:Controller %d cmd %d failed 0x%-04x count %d",
    "A command sent from the system to an interface processor failed to complete successfully."
   ],
   1
  ],
  0.7095852494239807
 ],
 [
  [
   [
    "FB-6-OIR:Card in slot %d %s",
    "A dial shelf feature card was inserted or removed from the specified slot. This is a informatory message."
   ],
   1
  ],
  0.747116208076477
 ],
 [
  [
   [
    "DSPU-3-CLSIUnexpctActSapCnf:CLSI unexpected ActivateSapCnf header= %s",
    "An internal software error occurred."
   ],
   1
  ],
  0.9120325446128845
 ],
 [
  [
   [
    "API_BAD_RESPONSE-3-LDP:ldp_api: bad response from LDP for \\%s\\",
    "Only one archive can be created at a time. Two or more simultaneous archives in progress is not allowed. This could occur for example if two users attempt to create an archive simultaneouly."
   ],
   0
  ],
  0.7053074240684509
 ],
 [
  [
   [
    "ETHER_PLATFORM_SW-3-DOT1AH_DEL_MAP_FAILED:Unable to remove 802.1ah mapping entry for B-MAC %e C-MAC %e.",
    "The Ethernet Software Platform was unable to remove an 802.1ah mapping entry from the tree of entries."
   ],
   1
  ],
  0.785311222076416
 ],
 [
  [
   [
    "DFP-4-UKN_CON:Manager %i Service %s - Unknown connection state %u",
    "Unknown connection state processing DFP timer"
   ],
   1
  ],
  0.7667685747146606
 ],
 [
  [
   [
    "CFT_API-7-CFT_ERRMSG_CLIENT_API:%s %s %d",
    "The DSP has reported that a Tx Control Message was dropped"
   ],
   0
  ],
  0.7479745745658875
 ],
 [
  [
   [
    "GDOI-5-KS_SEND_MCAST_REKEY:Sending Multicast Rekey %sfor group %s from address %s to %s with seq # %d spi: 0x%x%x%x%x",
    "Sending Multicast Rekey"
   ],
   1
  ],
  0.7471492886543274
 ],
 [
  [
   [
    "CXSC-3-CXSC_COND_DEBUG_REG_FAILED:%s",
    "This operation to build a TDL message for max entry add/delete has failed."
   ],
   0
  ],
  0.6751382350921631
 ],
 [
  [
   [
    "CASA-4-PORTCHANGE:Wildcard overlap: %s",
    "INVALID SPI RECOVERY SAs maximum limit has been reached."
   ],
   0
  ],
  0.697085976600647
 ],
 [
  [
   [
    "DSG-3-DSG_DCD_UPDATE_FAILURE:Faild to DCD message on %s",
    "DSG DCD update failure"
   ],
   1
  ],
  0.7572522759437561
 ],
 [
  [
   [
    "CPPDRV-4-HW_REV_OLD:Found HW revision %s using %s based on %s. No customer deployment.",
    "A BQS proxy failed to initialize the software memory region."
   ],
   0
  ],
  0.7541595101356506
 ],
 [
  [
   [
    "ALG_COM-3-ALG_REGISTER_FAILED:%d",
    "This message indicates that current user configuration could not be activated because of unavailability of memory resources. The NBAR cannot classify packets for this new protocol configured."
   ],
   1
  ],
  0.8118247389793396
 ],
 [
  [
   [
    "CIRRUS_PM-3-NOTCD2430:Device reported %#x",
    "The network module hardware reports that a non low-speed port module was detected."
   ],
   1
  ],
  0.7069092392921448
 ],
 [
  [
   [
    "FM-3-ILLEGALCOPY:Illegal copy of %s access group %s from %s label %d to %d",
    "An internal software error has occurred"
   ],
   1
  ],
  0.6699243783950806
 ],
 [
  [
   [
    "ALPS-5-ASCU_DISABLED_ASCU_STUCK:ASCU %02x on interface %s has been disabled since 4 consecutive messages were received from same SID.",
    "An ALPS ASCU has been automatically disabled."
   ],
   1
  ],
  0.735461950302124
 ],
 [
  [
   [
    "DEAD-4-SCARLET:Interface %s: I knew without asking she was into the blues",
    "The current task requires BERT hardware resources that are currentlyoccupied by other tasks."
   ],
   0
  ],
  0.7228847742080688
 ],
 [
  [
   [
    "ENVM-1-BP_THERMAL:System detected a thermal warning",
    "Over Temparature condition."
   ],
   1
  ],
  0.7183594107627869
 ],
 [
  [
   [
    "ETHER_SERVICE-6-UPDOWN:Service instance %d on interface %s changed to %s",
    "Service instance shutdown due to errdisable"
   ],
   1
  ],
  0.7152454853057861
 ],
 [
  [
   [
    "AC-3-L2SS_WRONG_KEYS:Wrong set of keys in %s message",
    "An internal software error occurred."
   ],
   0
  ],
  0.6627456545829773
 ],
 [
  [
   [
    "CES-4-INTERNAL_WARNING:%s",
    "The driver timed out waiting for completion of DMA task.  The DMA engine has been restarted."
   ],
   0
  ],
  0.778866708278656
 ],
 [
  [
   [
    "ATMPA-7-CWREG04:%s 0x%08x %s 0x%08x %s 0x%08x %s 0x%08x",
    "The hardware TCAM doesn't have the capacity to handle the number of logical operations used with the configured ACLs on this specific interface."
   ],
   0
  ],
  0.6331555247306824
 ],
 [
  [
   [
    "CRYPTO-4-IPSEC_AAA_STOP_FAILURE:IPSEC Accounting was unable to send stop record",
    "The AAA subsystem was unable to send the accounting stopon behalf of IPSec. This could be due to the AAA Server being unreachable."
   ],
   1
  ],
  0.7461487054824829
 ],
 [
  [
   [
    "IDS-4-RPC_PORTREQ_MOUNTD:Sig:6155:RPC mountd Portmap Request - from %i to %i",
    "The Auto-IP server is configured with pools of Auto-IP addresses. The IP addresses are assigned to the requesting ring ports. The Auto-IP address pool is exhaused and there are no more free addresses."
   ],
   0
  ],
  0.7258694171905518
 ],
 [
  [
   [
    "AAA-3-BADCURSOR:invalid cursor index %d max %d service %s protocol %s",
    "Unable to enter submode due to mode variable error"
   ],
   0
  ],
  0.7427648305892944
 ],
 [
  [
   [
    "HDV-1-TOOBIG:HDV in slot %d: packet size %d too big.",
    "A packet greater than the 256 bytes received on this interface."
   ],
   1
  ],
  0.826322078704834
 ],
 [
  [
   [
    "IDS-4-TCP_SYN_FIN_SIG:Sig:3041:TCP - SYN and FIN bits set - from %i to %i",
    "An internal software error occurred while transmitting data."
   ],
   0
  ],
  0.7905794978141785
 ],
 [
  [
   [
    "FR_RP_XDR-3-CLIENT_INIT_ERROR:FR XDR client initialization error: error code %u",
    "An error occurred while registering the FR RP XDR client.  Distributed packet forwarding over FR will not work."
   ],
   1
  ],
  0.7440838813781738
 ],
 [
  [
   [
    "FECPM-3-DSCC4:DSCC4 chip init slot %d failed",
    "An accounting record was dropped. The record could not be enqueued because the number of records in the output queue has exceeded the system limit."
   ],
   0
  ],
  0.5818376541137695
 ],
 [
  [
   [
    "HPI-3-CODEC_NOT_LOADED:channel:%s DSP ID:0x%x command failed as codec not loaded %d",
    "A messages sent by the KS to delete the GM has been received."
   ],
   0
  ],
  0.692599892616272
 ],
 [
  [
   [
    "CFT_API-3-CFT_ERRMSG_UNKNOWN:%s %s %d",
    "The error message type does not match the possible enumerated definitions."
   ],
   1
  ],
  0.7499251365661621
 ],
 [
  [
   [
    "CLB-4-CLB_VERSION_MISMATCH:%s",
    "Version mismatch forCluster load-balancer feature. Master could ignore some load attributes while calculating load of a Slave."
   ],
   1
  ],
  0.6573550701141357
 ],
 [
  [
   [
    "DBUS-3-DBUSINTERRSWSET:Slot %d Internal Error due to VIP crash",
    "A processor reported an error. The processor will be reset and not used until the next OIR event or microcode download when it will be retested."
   ],
   1
  ],
  0.6199466586112976
 ],
 [
  [
   [
    "CBUS-3-UNKENC:Interface %s unknown encaps type %x",
    "A packet was received from the CIP with an unknown encapsulation type. The packet will be dropped."
   ],
   1
  ],
  0.829797089099884
 ],
 [
  [
   [
    "DHCPD-6-LOW_UTIL:Pool \\%s\\ is in low utilization state %u addresses used out of %u. Threshold set at %u%%.",
    "The pool's utilization has fallen below the user configured high watermark."
   ],
   1
  ],
  0.5755711197853088
 ],
 [
  [
   [
    "CTS-4-SXP_STALE_NODE_ID_GEN:Interface configuration is changed may cause adverse affect on SXP functionality",
    "Change in interface configuration causing device to hold stale SXP Node ID."
   ],
   1
  ],
  0.7496538758277893
 ],
 [
  [
   [
    "CBR_LIC-6-LIC_SA_EVAL_EXPIRED:%s",
    "An internal software error occurred."
   ],
   0
  ],
  0.8116140961647034
 ],
 [
  [
   [
    "HA_EM-6-FMPD_SNMP_TRAPVAR_ADD:%s: Error adding trapvar to queue %s",
    "Pseudowire maximum limit reached for the L2 subscriber author group"
   ],
   0
  ],
  0.5640198588371277
 ],
 [
  [
   [
    "BGP-6-MSGDUMP_LIMIT:unsupported or mal-formatted message received from %s: \\n%s",
    "The remote BGP peer sent in a route with an illegal next hop.The given route was ignored."
   ],
   1
  ],
  0.6007168889045715
 ],
 [
  [
   [
    "CI-3-ASPREVC5500:***WARNING*** Cannot determine Power Supply type/detect Power Supply fan alarm \\n",
    "This message will appear as a reminder during C5X00 startup. The revision of the ASP installed in the router is unable to provide information about the power supply type and fan status."
   ],
   1
  ],
  0.6815547943115234
 ],
 [
  [
   [
    "ENSP-4-SMTP_NOT_CONNECTED:SMTP- failed %s %d",
    "Encountered a NULL context in L2SS Manager."
   ],
   0
  ],
  0.6793664693832397
 ],
 [
  [
   [
    "GDOI-5-COOP_KS_BLOCK_NEW_GM_REGISTER_ANN:This KS temporarily blocks GM with ip-addr %s from registering in group %s as it has not received an ANN with valid PST for prolonged period",
    "Other subsystem must have mistakenly add its own callback functions. This syslog is for debugging purpose."
   ],
   0
  ],
  0.7487916946411133
 ],
 [
  [
   [
    "DFP-4-BIND_FAIL:Failure binding port %u to socket for service %s.",
    "Problem with call to socket bind."
   ],
   1
  ],
  0.7460036277770996
 ],
 [
  [
   [
    "FMANRP_QOS-6-QOSCLASSEXIST:class %s id %u in policymap %s id %u already exists",
    "This is an informational message and no action  is required."
   ],
   1
  ],
  0.6762222051620483
 ],
 [
  [
   [
    "ALG_PROXY-4-PROXY_IPC_INVALID_MSG_LEN:%d:%d len %d flags 0x%x source %d",
    "Route Processor unable to send IPHC information to Line Card due to lack of memory in it's private memory pool."
   ],
   0
  ],
  0.5005204081535339
 ],
 [
  [
   [
    "ATMPA-3-INITERROR:In file %s - line %d",
    "Cannot create the CM622 Process Agent process which is a temp process to download firmware."
   ],
   1
  ],
  0.7341573238372803
 ],
 [
  [
   [
    "DOT1X-5-RESULT_OVERRIDE:Authentication result overridden for client %s on Interface %s AuditSessionID %s",
    "New TCP connection attempts to the specified host are no longer  blocked. This message indicates that the blocking of new TCP  attempts to the specified host has been lifted."
   ],
   0
  ],
  0.6277930736541748
 ],
 [
  [
   [
    "CRYPTO_HA_IPSEC-3-HA_IPSEC_UPDATE_PROC_FAIL:Start of HA IPSec update process failed",
    "Package version file extraction error. The cause of the failure is indicated in the error message. The indicated file might not be a valid FPD image package file."
   ],
   0
  ],
  0.5947603583335876
 ],
 [
  [
   [
    "HA_CONFIG_SYNC -6-BULK_CFGSYNC_SUCCEED:Bulk Sync succeeded",
    "ONEHOUR"
   ],
   0
  ],
  0.7328168153762817
 ],
 [
  [
   [
    "AAAA-3-OVERWRITE:Overwrote internal buffer space %s",
    "An internal software error."
   ],
   1
  ],
  0.6261215806007385
 ],
 [
  [
   [
    "DP83815-6-EXCESSCOLL:%s",
    "The current primary TDM clock has been deleted and hence the system primary has switched to the DSC local oscillator which  is the current highest priority good clock.  Phase continuity is maintained during the switchover."
   ],
   0
  ],
  0.5010092258453369
 ],
 [
  [
   [
    "HSRP-3-NOSOCKET:Unable to open socket",
    "The system was unable to initialize an IP connection for the Hot Standby protocol."
   ],
   1
  ],
  0.7580788731575012
 ],
 [
  [
   [
    "AAA-3-BUFFER_OVERFLOW:Radius I/O buffer has overflowed",
    "Initialization of teardown pool failed."
   ],
   0
  ],
  0.7253212928771973
 ],
 [
  [
   [
    "ENT_ALARM-3-NOALARMENT:%s",
    "All entities that could have alarm conditions set for them should be  registered with the alarm subsystem for the Cisco IOS  software. This message indicates that the normal registration  of entities in the Cisco IOS software alarm subsystem has  failed and one or more entities could not be registered.  The message text indicates the alarm entity that could not  be registered. Note that alarm conditions against the entity  specified in the message text if there are any cannot be reported. This message does not indicate that the entity specified in the  message has undergone an error condition."
   ],
   1
  ],
  0.7528330087661743
 ],
 [
  [
   [
    "CT3-3-CT3NOACC:%s - Accumulator is not available",
    "An invalid TX accumulator is detected."
   ],
   1
  ],
  0.6864744424819946
 ],
 [
  [
   [
    "CGC-0-CGC_EMERG:%s",
    "This error message is displayed when the system cannot find the chipset registers where it expects them to be. This is most likely a hardware error."
   ],
   0
  ],
  0.6987746357917786
 ],
 [
  [
   [
    "DSCC4-3-OWNERR:DSCC4%d/%d Buffer ownership error pak=0x%x",
    "An internal software error occurred."
   ],
   1
  ],
  0.6815442442893982
 ],
 [
  [
   [
    "ACL-3-UNEXPECTED_PKT_TYPE:type %d int %d %sput",
    "An internal software error occurred."
   ],
   0
  ],
  0.7014022469520569
 ],
 [
  [
   [
    "FMANRP_NAT-3-PORTLISTTDLMSGMARSHAL:Failed to copy portlist config message to IPC buffer for addr %i proto %d start_port %d end_port %d",
    "An error occurred while CTS attempted to service a Change of Authorization request for the update-rbacl command"
   ],
   0
  ],
  0.6875233054161072
 ],
 [
  [
   [
    "DSPU-3-ActpuNegResponse:ACTPU Neg rsp received from PU %s",
    "A ring node detects an R-APS message with a lower level than the configured G.8032 instance level for that APS Channel. This is a Failure of Protocol - Provisioning Mismatch - Level due to a misconfiguration of the APS level of nodes in the ring."
   ],
   0
  ],
  0.6261215806007385
 ],
 [
  [
   [
    "CE3-1-UNSUPPORTED:\\n%s",
    "The system does not have enough free main memory to create the specified resource."
   ],
   0
  ],
  0.6505032777786255
 ],
 [
  [
   [
    "CPU_REDUN-6-RUNNING_CONFIG_CHG:Running config on this CPU has possibly changed",
    "Informational message to notify of possible changes to the  running-config file"
   ],
   1
  ],
  0.6316606998443604
 ],
 [
  [
   [
    "CLI_AGENT-3-ECI_TIMEOUT:Maximum timeout has been reached while waiting for cli-agent to respond: %d seconds",
    "CLI Agent did not reply to IOS within expected timeout"
   ],
   1
  ],
  0.6840657591819763
 ],
 [
  [
   [
    "AT-3-NOROUTE:No route to destination %a",
    "You attempted to remove a route from the routing table by issuing the clear appletalk route command. The command failed because the route was on a directly connected interface that is it was created when you configured the router."
   ],
   1
  ],
  0.6394407153129578
 ],
 [
  [
   [
    "FM-4-L2EOU_VACL:VACL Capture & L2EOU conflict on i/f %s",
    "The ETHERNET OAM ISSU client failed to calculate the MTU for the specified message. The ETHERNET OAM ISSU client is not able to send the message to the standby device."
   ],
   0
  ],
  0.6883763670921326
 ],
 [
  [
   [
    "EVTMON_PROXY-4-PROXY_IPC_EVTMON_REC_UPDATE_FAILED:event record update failed",
    "Event monitor failed to attach or detach event record."
   ],
   1
  ],
  0.7993702292442322
 ],
 [
  [
   [
    "DSC_REDUNDANCY-3-SLOTCONFLICT:Slot ownership conflict detected for slot %d",
    "There is another router connected to the dial shelf it is claiming ownership of a slot that this router is also claiming"
   ],
   1
  ],
  0.7468793392181396
 ],
 [
  [
   [
    "CTS-6-AUTHZ_POLICY_SGACL_NO_CHANGE:Policy refresh for sgt%s indicates no change",
    "No SGACL change for SGT"
   ],
   1
  ],
  0.6697401404380798
 ],
 [
  [
   [
    "ACLMERGE-3-CUDDWARN:A CUDD Library warning message for interest in this event in %s",
    "Debug message only. No action required"
   ],
   1
  ],
  0.6795804500579834
 ],
 [
  [
   [
    "EDSP-6-IPV6_FAILED:NULL",
    "There is not enough free memory to handle DNS queries."
   ],
   0
  ],
  0.7565089464187622
 ],
 [
  [
   [
    "IGMP-4-MROUTE_IC_FLAG:While adding or deleting multicast state some state may not correctly have local interest flag set or cleared.",
    "Repeated attempts to adjust local interest flag were running over time and some state may not have been adjusted."
   ],
   1
  ],
  0.7009642720222473
 ],
 [
  [
   [
    "CPUPORTMONITOR-2-SYSTEM_CNTL_REG:\\\\n Value of System Control Register: 0x%x \\n",
    "An ALPS ASCU has been automatically disabled."
   ],
   1
  ],
  0.7474311590194702
 ],
 [
  [
   [
    "FRR_OCE-3-INVALID_BFD_EVT:Error in BFD event retrieval bfd notification handle is %p session handle is %p",
    "Key server has reached a condition of blackholing messages from GMSome might consider this a hostile event."
   ],
   0
  ],
  0.5009232759475708
 ],
 [
  [
   [
    "HAL-3-LOVEFAIL:%s: failed to send %s love letter",
    "A love letter was not sent to RSP."
   ],
   1
  ],
  0.5756557583808899
 ],
 [
  [
   [
    "CPPDRV-4-CORE_TABLE:CPP%d specific core dump table '%s' not found using minimal fallback table '%s' instead",
    "OOC duration timer has started. All entitlements will be Capped Enforced in 270 days."
   ],
   0
  ],
  0.6740628480911255
 ],
 [
  [
   [
    "FPD_MGMT-6-BUNDLE_DOWNLOAD:Downloading FPD image bundle for %s card in %s ...",
    "The system is downloading the field programmable device image bundle to the system main memory."
   ],
   1
  ],
  0.674979031085968
 ],
 [
  [
   [
    "DBMS-3- TABLE:%s",
    "The specified operation in the table component failed."
   ],
   1
  ],
  0.6269267797470093
 ],
 [
  [
   [
    "FM-2-BAD_MESSAGE:Error in internal messaging - bad result %d",
    "One of the router's cooling fans failed."
   ],
   0
  ],
  0.6717950701713562
 ],
 [
  [
   [
    "FW-4-ALERT_ON:%s%s count %d/%d current 1-min rate: %d",
    "The string written into the allocated buffer exceeded the size of the buffer. This can cause memory corruption."
   ],
   0
  ],
  0.732734739780426
 ],
 [
  [
   [
    "DTLS2-3-SETUP_FAILED:Failed to setup connection - %s.",
    "IOS recieved a message with invalid context ID.ECI cannot find the coresponding context from the table"
   ],
   0
  ],
  0.7810859680175781
 ],
 [
  [
   [
    "FMANRP_NAT-3-STATSUPDTDL:Failed to update NAT %s statistics",
    "FMANRP_NAT_LIMIT"
   ],
   1
  ],
  0.760014533996582
 ],
 [
  [
   [
    "DCU-1-NOMEMORY:Unit %d no memory for %s",
    "Interface configuration field was modified unexpectedly."
   ],
   0
  ],
  0.7869579195976257
 ],
 [
  [
   [
    "CBR_SPA-3-RAPTOR_INIT_ERROR:%s Raptor err %d",
    "Raptor driver initialization error"
   ],
   1
  ],
  0.5461313128471375
 ],
 [
  [
   [
    "AMDP2_FE-3-SPURIDON:%s spurious chip init CSR%d=0x%04x",
    "An illegal condition indicating initialization done has occurred."
   ],
   1
  ],
  0.6901319026947021
 ],
 [
  [
   [
    "EHSA-3-KEEPTO:No keepalive seen in [%d] secs: Failover %s",
    "EHSA keepalive failure."
   ],
   1
  ],
  0.6159631609916687
 ],
 [
  [
   [
    "BGP-6-ATTR_FLAG:BGP update error: %s Wrong flag 0x%x received for %s attribute fixed by error handling",
    "The remote BGP peer sent in a route with an invalid optional transitive attribute."
   ],
   1
  ],
  0.5407522916793823
 ],
 [
  [
   [
    "CRYPTO-3-PAL_INTERNAL_ERROR_BAD_TRANSITION:Internal error: state %s has unrecognized transition %d",
    "An error has occurred opening the login banner. It could not be displayed to a user connecting via telnet."
   ],
   0
  ],
  0.661658763885498
 ],
 [
  [
   [
    "CPPDRV-6-ACCTRC16B:Access CPP %d address 0x%08llX Blk/Off:%d/0x%08llX %s %3d bytesmsgdef_explanation",
    "interface number is already in use"
   ],
   0
  ],
  0.7839825749397278
 ],
 [
  [
   [
    "FASTHELLO-5-FH_DUAL_ACTIVE_CAP:Fast-Hello interface %s became dual-active detection capable\\n",
    "FASTHELLO STATUS became dual-active detection capable with more detail status"
   ],
   1
  ],
  0.5902736186981201
 ],
 [
  [
   [
    "COMMON_FIB-3-SBNOTISSUAWARE:Subblock %s is not ISSU aware and should be!",
    "Normal response for CPU EHSA Redundancy services. The details about what was sent will be printed."
   ],
   0
  ],
  0.8487589359283447
 ],
 [
  [
   [
    "CBR_SPA-3-ESI_PLL_CTRL_LOCK_ERROR:%s unable to lock Raptor ESI PLL",
    "Raptor-ESI PLL not locked"
   ],
   1
  ],
  0.7067743539810181
 ],
 [
  [
   [
    "CT3-3-LOVEFAIL:%s: failed to send %s love letter",
    "No available voice RTP ports were found."
   ],
   0
  ],
  0.7744829654693604
 ],
 [
  [
   [
    "BGP-4-BGP_OUT_OF_MEMORY:BGP resetting because of memory exhaustion.",
    "BGP tried to perform an operation that required additional memory and was not able to allocate it."
   ],
   1
  ],
  0.7485692501068115
 ],
 [
  [
   [
    "DCU-1-INITFAIL:Unit %d initialization timeout failure csr%d=0x%04x",
    "The system does not have enough free memory to accept a new call.  The specified call was rejected."
   ],
   0
  ],
  0.6671751737594604
 ],
 [
  [
   [
    "CLSDR-3-MSGERR:%s couldn't get a message",
    "TE LSP batch forwarding installation issue"
   ],
   0
  ],
  0.756574273109436
 ],
 [
  [
   [
    "CD_FFP_IPSEC_PROXY-2-FFP_PROXY_INIT_FAILED:FFP Crypto device Procy Agent Proxy IPC interface initialization failure result: %d.",
    "An unexpected condition has occurred while IOS is building a TDL message to send to the Shell Manager"
   ],
   0
  ],
  0.6285083293914795
 ],
 [
  [
   [
    "ACCESS_IE-3-INVALID_HANDLE:Caller passed in invalid handle - traceback to follow.",
    "An invalid handle was encountered in the Access IE library."
   ],
   1
  ],
  0.8045433163642883
 ],
 [
  [
   [
    "CXSC-3-FEAT_DOWN:CXSC-Invalid request %s %u while feature is down",
    "An internal error was detected when initializing Embedded Event Manager service."
   ],
   0
  ],
  0.7440037727355957
 ],
 [
  [
   [
    "CLI_AGENT-3-MARSHAL:Error %d marshaling TDL message [%s] buffer length %d: %s",
    "Flow creation was prevented by a flow table client. This may be due to an explicit policy that is enabled."
   ],
   0
  ],
  0.6615472435951233
 ],
 [
  [
   [
    "ENV_MON-6-REMPEM_GSR_POWERSHELF:Powersupply %s removed",
    "This message documents the opening of an inspection session on  standby router. The message is issued at the start of each inspected session and it records the source/destination addresses and ports."
   ],
   0
  ],
  0.7058436870574951
 ],
 [
  [
   [
    "CPP_FM-4-CPP_FM_FIELD_IGNORED:Matching on field type %u %s value %u 0x%x msgdef_explanation",
    "Triggered when someone tries to tftp a password file."
   ],
   0
  ],
  0.7869019508361816
 ],
 [
  [
   [
    "CFGMGR-6-UNABLE_TO_NVGEN_RUNNING_CFG:config file too large...",
    "The Event Trace subsystem can not close the specified file"
   ],
   0
  ],
  0.7159211039543152
 ],
 [
  [
   [
    "AAAA-3-BADAUTHENSTR:Bad authentication data: %s",
    "A Config command has been executed to remove a Key Server from a group"
   ],
   0
  ],
  0.6025640368461609
 ],
 [
  [
   [
    "DMTDSL-3-DMTHWBAD:DMTDSL%d/%d Hardware failed self test",
    "A process which manages network interface background processing  is not yet running but another system process has tried to send  the process a message."
   ],
   0
  ],
  0.6668434739112854
 ],
 [
  [
   [
    "ETHCNTR-3-NO_HARDWARE_RESOURCES:Not enough hardware resources. Shutting down %s",
    "The number of ALPS circuit drops due to invalid ASCU identifier   exceeds the ALPS circuit threshold value."
   ],
   0
  ],
  0.5633957386016846
 ],
 [
  [
   [
    "GEN_PROXY-3-REPLY_MSG:wrong version %d",
    "Policy Installation SM STOP"
   ],
   0
  ],
  0.7209632396697998
 ],
 [
  [
   [
    "HPI-6-SRTP_EVAL_LIMIT:The SRTP bandwidth and tunnels usage exceed the license limits",
    "The virtual-interface feature will not work without a virtual-access interface. The EzVPN configuration is unusable. You can choose to remove virtual-interface configuration from ezvpn as a workaround"
   ],
   0
  ],
  0.7009642720222473
 ],
 [
  [
   [
    "CTS-3-ROOT_CA_STORE_FAIL:Could not install the CTS trusted-root certificate.",
    "An attempt to connect to a remote TCP BSTUN peer failed."
   ],
   0
  ],
  0.7277588844299316
 ],
 [
  [
   [
    "HQF-3-OH_FRAG_NOT_ALLOWED_TOGETHER:Can't configure Overhead Accounting and fragmentation together!",
    "Overhead Accouting feature currently is not allowed to coexist with fragmentation configration."
   ],
   1
  ],
  0.7476686239242554
 ],
 [
  [
   [
    "CLI_AGENT-3-BIPC_INIT:Unable initialize BIPC connection to cli-agent",
    "An unexpected internal error was encountered. Please note and report to  Cisco technical support."
   ],
   0
  ],
  0.7063188552856445
 ],
 [
  [
   [
    "FLASH-3-DEVERR:Error accessing the device : Device number = %d Error number = %d",
    "Error was detected in accessing the device."
   ],
   1
  ],
  0.5409126281738281
 ],
 [
  [
   [
    "BW_LICENSE-4-THROUGHPUT_MAX_LEVEL:Average throughput rate approached the licensed bandwidth of %s during %d sampling periods in the last 24 hours sampling period is %d seconds",
    "A QFP resource has recovered from the critical level."
   ],
   1
  ],
  0.7723711729049683
 ],
 [
  [
   [
    "CRYPTO-4-EZVPN_FAILED_TO_CONNECT:%s",
    "Running Config file was sent to the Standby CPU"
   ],
   0
  ],
  0.5013527870178223
 ],
 [
  [
   [
    "CTS-4-SLIST_ADD_TO_NAMED_LIST_FAILED:%s:tag%s - failed to add server%i:%u to named list.",
    "Insufficient memory is available to initialize Gateway"
   ],
   0
  ],
  0.6075811386108398
 ],
 [
  [
   [
    "CALLRECORD-6-MICA_TERSE_CALL_REC:%s",
    "Syntax error in a URL or COOKIE regular expression in SLB configuration."
   ],
   0
  ],
  0.5286911129951477
 ],
 [
  [
   [
    "CLI_AGENT-3-ECI_CTX:Unable to get %s for %s",
    "An error occurred when memory configuration was attempted."
   ],
   0
  ],
  0.6706386208534241
 ],
 [
  [
   [
    "DSCCLOCK-3-SWITCH8:Moving to NORMAL mode from HOLDOVER mode without phase correction clock is slot %d port %d line %d",
    "The source trunk port of the TDM primary clock which had gone bad  has turned good again before the holdover timer expiry. Hence the  primary has moved from HOLDOVER to NORMAL state without phase  correction between input trunk reference and the output TDM clock."
   ],
   1
  ],
  0.7962777018547058
 ],
 [
  [
   [
    "AAA-3-SERVER_INTERNAL_ERROR:Server '%s': %s",
    "This is an internal software error in the AAA server group subsystem."
   ],
   1
  ],
  0.7642351984977722
 ],
 [
  [
   [
    "CLUE-3-INVALID_AREA:Either address %#x or size %d reserved for CLUE storage area is invalid",
    "Internal Compact Local Unit Exchange CLUE software error where CLUE  expected a non-zero reserved memory address and a non-zero reserved  memory size to initialise and use the reserved area as a CLUE storage  area."
   ],
   1
  ],
  0.7230071425437927
 ],
 [
  [
   [
    "EDSP-6-CEF_WAIT:NULL",
    "An error occured while the system attempted to encode the swidb into the data-descriptor"
   ],
   0
  ],
  0.6425113081932068
 ],
 [
  [
   [
    "ETSEC-3-OWNERR:PQ3/FE%d Buffer ownership error pak=0x%x",
    "The FCPA particle mgmt has an error."
   ],
   0
  ],
  0.7014022469520569
 ],
 [
  [
   [
    "FPD_MGMT-3-MISSING_IMAGE:Could not find the required %s image FPD ID=%u and FPD version=%u.%u compatible with HW version=%u.%u from the %s-fpd.bndl bundle in %s msgdef_explanation",
    "IFC Received AUTHC NO RESP"
   ],
   0
  ],
  0.7792074680328369
 ],
 [
  [
   [
    "BGP_LMM-6-AUTOGEN1:%s interface: %s",
    "The mpls bgp forwarding command has been automatically configured on an interface"
   ],
   1
  ],
  0.8251921534538269
 ],
 [
  [
   [
    "CPPHA-3-BULKSYNC:bulk sync processing failed to complete",
    "The CDM process is not running."
   ],
   1
  ],
  0.641197144985199
 ],
 [
  [
   [
    "HA_EM-7-FMC_REG_CBH_PULSE:%s: Unable to locate reg callback entry for pulse code %d",
    "Intermediate System-to-Intermediate system IS-IS allows only three area addresses per area. Multiple routers with at least one area address in common merge all of their configured area addresses into a single set. If the resulting set includes more than three area addresses this message appears and indicates that there will be a loss of connectivity to the specified area."
   ],
   0
  ],
  0.7527577877044678
 ],
 [
  [
   [
    "CHOPIN_MAINBOARD_ASYNC_PQII-3-NOMEMORY:No memory for %s of unit %d",
    "The router does not have enough memory to perform the function"
   ],
   1
  ],
  0.6136319041252136
 ],
 [
  [
   [
    "HA_EM-3-FMFD_TTY_NUM:%s: Error occurred while fetching TTY number.",
    "The DOI field of an SA offer defines how to parse the fieldsSAs with an unknown DOI cannot be parsed"
   ],
   0
  ],
  0.6585533022880554
 ],
 [
  [
   [
    "CRYPTO-5-IKEV2_SESSION_STATUS:Crypto tunnel v2 is %s. Peer %s:%d %s %s %s %s %s %s %s %s",
    "This is a notification message for IPSEC tunnel status"
   ],
   1
  ],
  0.6569146513938904
 ],
 [
  [
   [
    "GEFC-3-MIB_LASER_TX_FLT_ALM:Laser Transmit Fault %s %s %s",
    "An error occcured while the Standby is receiving sync data from the Active."
   ],
   0
  ],
  0.6746990084648132
 ],
 [
  [
   [
    "BSTUN-6-CONNOPENFAIL:CONN: peer %s open failed %s [%u]",
    "An attempt to connect to a remote TCP BSTUN peer failed."
   ],
   1
  ],
  0.7364523410797119
 ],
 [
  [
   [
    "IF-4-NOBGPROCESS:Network background process not running. %s",
    "The requested operation could not be accomplished because of a low memory condition."
   ],
   0
  ],
  0.7136561274528503
 ],
 [
  [
   [
    "CXSC-2-IPC_INIT_FAILED:CXSC-IPC message handler registration failure rc %u",
    "The mLACP TLV length is longer than the total message length."
   ],
   0
  ],
  0.5137571692466736
 ],
 [
  [
   [
    "DYNCMD-3-MSGMISSINGFIELD:Missing field '%s' in TDL message '%s' received from the Shell Manager",
    "A message missing a required field was received from the Shell Manager"
   ],
   1
  ],
  0.7395164966583252
 ],
 [
  [
   [
    "C542-3-INCORRECT_PMID:VPM at slot %d: Incorrect %d PM-ID device not supported.",
    "A interface controller device did not have the correct PM-ID in eeprom cookie."
   ],
   1
  ],
  0.6384902596473694
 ],
 [
  [
   [
    "CPPHA-6-SYSINIT:CPP HA system %s.",
    "IFC Entering DISCONNECT State"
   ],
   0
  ],
  0.6860065460205078
 ],
 [
  [
   [
    "ALPS-5-CIRCUIT_CLOSED:Circuit %s changed state to closed rsn = %s.",
    "A hash operation required by the IKE protocol exceeded an internal limit. The IKE SA negotiation was rejected. That can happen if an inordinately large number of IKE policies were being proposed by the initiator"
   ],
   0
  ],
  0.7554582953453064
 ],
 [
  [
   [
    "AAA-3-DROPACCTFAIL:Accounting record dropped send to server failed: %s",
    "LOG_STD_DBG_ACTION"
   ],
   0
  ],
  0.7200630903244019
 ],
 [
  [
   [
    "BACKUP_INTERFACE-5-PREEMPT:Preempting interface %s in backup pair %s %s preemption mode is %s",
    "Preempting the current forwarding interface in the backup interface pair."
   ],
   1
  ],
  0.8264156579971313
 ],
 [
  [
   [
    "CTS-5-SXP_BINDING_DEL:Binding %s<%s %s>-<%i %d> deleted in SXP database.",
    "An unexpected condition has occurred which is due to the absence of an v4 ACE structure."
   ],
   0
  ],
  0.693509042263031
 ],
 [
  [
   [
    "HA_EM-7-FMS_INV_ARG_STRING:%s: Invalid argument string: %s",
    "While showing a list the list was changed or elements changed. This can happen if SA's are re-negotiated at the time the show-command was paused or if someone reconfigured or cleared SA's amongst other things. This is not an error but a side-effect of a dynamic system."
   ],
   0
  ],
  0.7758893966674805
 ],
 [
  [
   [
    "FR_VCB-5-UPDOWN:FR VC-Bundle %s changed state to %s",
    "The state of a frame-relay vc-bundle changed to up/down"
   ],
   1
  ],
  0.5995293259620667
 ],
 [
  [
   [
    "AMDP2_FE-3-TOOMANYPART:Bad packet with %d particles pak=0x%x",
    "The Feature Manager was able to fit more of the configured features on this label into the hardware. One or more features had previously been unloaded because of lack of space."
   ],
   0
  ],
  0.708961546421051
 ],
 [
  [
   [
    "CLNT_REG-7-LDP:%s successful for protocol %s context %s",
    "A client component has re/deregistered successfully with LDP. It can now add/delete/modify its entries in the database"
   ],
   1
  ],
  0.8450769186019897
 ],
 [
  [
   [
    "DMA-3-DTQ_DISPATCH_DIRTY_PAK:pak not cleaned up by Egress processing appId %d",
    "After dtq dispatched a packet to Egress processing packet is not cleaned up by application"
   ],
   1
  ],
  0.7994483113288879
 ],
 [
  [
   [
    "DCU-3-DCU_RESET:%s: DCU keep-alive failure card reset",
    "Port Adapter has stopped processing keep-alives."
   ],
   1
  ],
  0.5930350422859192
 ],
 [
  [
   [
    "DSCC4-1-INITFAIL:DSCC4%d/%d SCC%d init failed",
    "The software failed to initialize/restart an SCC of a serial interface"
   ],
   1
  ],
  0.7042328119277954
 ],
 [
  [
   [
    "CT3-1-INITFAIL:Slot %d firmware init %s",
    "This is an important High Availability System notice logging the state of a system cutover of the standby system to the active system. Messages of this type indicate that the active system reliquished system control and that the standby system is taking over as active."
   ],
   0
  ],
  0.6117913722991943
 ],
 [
  [
   [
    "HA-5-SYNC_RETRY_FAIL:Maximum sync retries exceeded. Reloading standby and cancelling sync.",
    "General error information."
   ],
   0
  ],
  0.7451972961425781
 ],
 [
  [
   [
    "GEN_PROXY-3-IPC_UNHANDLED:failure",
    "An unknown message type: %d was received by the Generic Client Proxy."
   ],
   1
  ],
  0.7108830213546753
 ],
 [
  [
   [
    "GT96100-3-TIMER:Interrupt error c=%#x m=%#x rc=%#x",
    "An unexpected timer interrupt was received from a timer element that was not initialized by software."
   ],
   1
  ],
  0.6660735607147217
 ],
 [
  [
   [
    "CRYPTO-5-IKMP_SETUP_FAILURE:IKE SETUP FAILED for local:%s local_id:%s remote:%s remote_id:%s IKE profile:%s fvrf:%s fail_reason:%s fail_class_cnt:%ld",
    "IKE Negotiation Failed."
   ],
   1
  ],
  0.8329895734786987
 ],
 [
  [
   [
    "ATMPA-3-FWCKSUM:%s SAR firmware checksum error expected 0x%04x obtained 0x%04x",
    "The OIR facility detected the insertion of alarm card from slot [n]."
   ],
   0
  ],
  0.8271589875221252
 ],
 [
  [
   [
    "CSM_SLB-3-PORTCHANNEL:Portchannel allocation failed for module %d.",
    "The IP address requested has been found to be already in use on some interface connected to the system or within the system itself."
   ],
   0
  ],
  0.6810764670372009
 ],
 [
  [
   [
    "HDX-3-BADFSM:On int %d/%d unexpected state %d event %d",
    "The maximum number of profiles that can be defined in device profiles exceeded the maximum limit.The device classifier will be operationally down if failure occured for the Embedded profiles."
   ],
   0
  ],
  0.6940085291862488
 ],
 [
  [
   [
    "HAL-1-NOTREADY:Slot %d for microcode download",
    "Spare pair power request was successful and power is available on spare pair"
   ],
   0
  ],
  0.6799400448799133
 ],
 [
  [
   [
    "IDMNGR-3-INVALIDEVENT:Error: Invalid process event received %d",
    "Internal process error"
   ],
   1
  ],
  0.7373049855232239
 ],
 [
  [
   [
    "DSC_ENV-0-SHUTDOWN:Slot %d %s %u %s",
    "The card enviromental parameters specified are outside the normalrange of operation."
   ],
   1
  ],
  0.7558497786521912
 ],
 [
  [
   [
    "FLOWMON-2-FLOW_THRESHOLD_EXCEEDED:Performance_Traffic_TCA[%s]: Exceeded configured %u current %u",
    "Transceiver has Cable cut or removed"
   ],
   0
  ],
  0.6681538820266724
 ],
 [
  [
   [
    "ATMSIG-3-ATMSIG_CUG_DELETE_FAILED:ATMSIG%s",
    "The system was unable to perform the indicated operation on the indicated file for the indicated reason"
   ],
   0
  ],
  0.7614004015922546
 ],
 [
  [
   [
    "ENV_MON-6-CANTSHUT:Cannot shut down card in this slot",
    "Failed to acquire configuration lock. Rollback did not start. In this case retry will be scheduled."
   ],
   0
  ],
  0.7000940442085266
 ],
 [
  [
   [
    "DIRECTOR-5-SVRUPDOWN:server %i on port %d has gone %s",
    "The remote server has gone up or down"
   ],
   1
  ],
  0.7759366035461426
 ],
 [
  [
   [
    "DLSWP-3-PBADVALUE:%s: invalid %s %d",
    "The CE3 hardware failed. Some components on the board failed to initialize."
   ],
   0
  ],
  0.7484301924705505
 ],
 [
  [
   [
    "CSM_SLB-6-RSERVERSTATE:Module %d server state changed: %s",
    "This message indicates the IDPROM of this unit could not be accessed or was found to be corrupt either due to a hardware problem or manufacturing problem."
   ],
   0
  ],
  0.618015468120575
 ],
 [
  [
   [
    "CBUS-3-CTRCMDFAILED2:Interface %s CTR Command %s Failed Code %#04x",
    "A command sent from the system to the Token Ring interface failed to complete successfully."
   ],
   1
  ],
  0.6876370906829834
 ],
 [
  [
   [
    "FIB-3-MAC_ACCT:%s: %s",
    "IPV4FIB_INTERNAL_ERROR"
   ],
   1
  ],
  0.994936466217041
 ],
 [
  [
   [
    "E_CFM-3- TIMEOUT_TOO_SMALL:Attempted to start a timer with a value less than the minimum permitted %ums defaulting to %ums.",
    "The monitoring process has hit an event. The process has fulfilled its purpose it can now be killed."
   ],
   0
  ],
  0.7135301232337952
 ],
 [
  [
   [
    "ESS_PROXY-2-KA_PKT_TMPL_BFR_ALLOC_FAILED:CPP ESS Proxy Session Keepalive packet template allocation failure %s buffer length: %d.",
    "IPSec SAs have been converted to bidirectional mode in a groupon a GM by a CLI command"
   ],
   0
  ],
  0.6898775696754456
 ],
 [
  [
   [
    "ARCHIVE_DIFF-5-ROLLBK_CNFMD_CHG_RESET_IDLETIMER:User: %s Reset Rollback Confirmed Change timeridle to %lu minute",
    "The cns event agent is not configured. The event that was to be  sent to it will be dropped"
   ],
   0
  ],
  0.6960686445236206
 ],
 [
  [
   [
    "AP-5-AUTHC_RESULT:Authenticatiion %s for HOST IP %s MAC %e AuditSessionID %s on Interface %s",
    "An unexpected condition has occurred when updating mac ACL statistics"
   ],
   0
  ],
  0.8182088136672974
 ],
 [
  [
   [
    "EPLD_STATUS_OPEN-4-ERROR_ALLOC:\\n%%Error: Can't allocate %d bytes for epld status data",
    "The system is unable to allocate required memory to access the file."
   ],
   1
  ],
  0.6785418391227722
 ],
 [
  [
   [
    "ARAP-3-REMOTEERROR:TTY %d: arap input error",
    "ARAP connection was terminated without a known cause."
   ],
   1
  ],
  0.8123477101325989
 ],
 [
  [
   [
    "DC-6-DEFAULT_INIT_INFO:%s",
    "During GDOI registration protocol a proposal sent by the key server was refused by the group member."
   ],
   0
  ],
  0.7270241975784302
 ],
 [
  [
   [
    "dtsec-3-ERRINT:%s error interrupt mac_status = 0x%016llx",
    "The MAC controller has signalled an error condition."
   ],
   1
  ],
  0.5390309691429138
 ],
 [
  [
   [
    "AAAA-6-ADMINMSG:%s %s: %s",
    "This administrative message was passed to the NAS from the AAA server"
   ],
   1
  ],
  0.6554577946662903
 ],
 [
  [
   [
    "GDOI-5-POLICY_CHANGE_ERROR_MULTIPLE_PORTS:Multiple ports detected for ACL %s which is not supported. WARNING: No TEK policy will be created.",
    "Informs user that there is an error in the ACL with regards to thenumber of ports."
   ],
   1
  ],
  0.7377555966377258
 ],
 [
  [
   [
    "ARAP-6-MNP4T401:TTY %d: T401 %d baud rate %d",
    "Eval Period has expired. License agent moving to eval-expired state"
   ],
   0
  ],
  0.728280246257782
 ],
 [
  [
   [
    "AT-7-BUGREPORT:AppleTalk bug: %s",
    "The software detected an unexpected condition. The router takes corrective action and continues."
   ],
   1
  ],
  0.7073862552642822
 ],
 [
  [
   [
    "FPD_MGMT-3-INVALID_PKG_FILE:The indicated file %s is not a valid FPD image package file - %s",
    "Firewall High Availability could not register as a Redundancy Facility client"
   ],
   0
  ],
  0.716437816619873
 ],
 [
  [
   [
    "CEM-1-ISSU_NOMEMORY:msgtxt_nomemory",
    "An internal software error occurred."
   ],
   0
  ],
  0.6520113945007324
 ],
 [
  [
   [
    "CALL_HOME-3-FAIL_TO_RETRIEVE_SCH_STATUS:Fail to retrieve device registration result.  check SCH registration status with \\call-home request registration-info\\ under EXEC mode.",
    "Fail to retrieve device registration result. Call-home will abort polling progress."
   ],
   1
  ],
  0.702149510383606
 ],
 [
  [
   [
    "IFMGR-7-NO_IFINDEX_FILE:Unable to open %s %s",
    "The protect linecard has lower license."
   ],
   0
  ],
  0.5068744421005249
 ],
 [
  [
   [
    "DC-3-SM_API:%s return %s.",
    "One of the events LOS or AIS or CLI command .. has caused a change in clock selected"
   ],
   0
  ],
  0.639992892742157
 ],
 [
  [
   [
    "CLUE-3-INIT_ERROR:Failed to initialise the reserved memory for new CLUE context due to %s",
    "Reserved memory for Compact Local Unit Exchange CLUE storage area was  not initialised due to the reason given. CLUE storage area will not be  available to provide any CLUE service."
   ],
   1
  ],
  0.5641055703163147
 ],
 [
  [
   [
    "CT3-1-UNSUPPORTED:\\n%s",
    "A CT3 Port Adapter was detected which has a revision earlier than rev3. This port adapter pre-dates the router platform it has been installed in and is not a supported combination."
   ],
   1
  ],
  0.6108155250549316
 ],
 [
  [
   [
    "IDS-4-IPOPT_SATID_SIG:Sig:1005:IP options-SATNET ID - from %i to %i",
    "A severe checkpointing error occured as the system was unable to establish an interprocess communications session between the Active and the Standby peers."
   ],
   0
  ],
  0.7316359877586365
 ],
 [
  [
   [
    "GK-3-PROC_NOCREAT:\\ Unable to create gatekeeper process. Gatekeeper bringup failed.",
    "An internal error has occured."
   ],
   1
  ],
  0.6827934384346008
 ],
 [
  [
   [
    "HA_EM-7-FMFD_SNMP_ERRCODE:%s: %s",
    "Internal data structures are corrupted."
   ],
   0
  ],
  0.7745662927627563
 ],
 [
  [
   [
    "GSMAMRNB_ENABLER-3-GSMAMRNB_LICENSE_EULA_NOT_ACCEPTED:\\n********************************************************* \\ \\nWARNING: GSM AMR-NB License is not yet activated. \\ \\nPlease configure 'license feature gsmamrnb-codec-pack'\\ \\nand accept the EULA to activate the license. \\ \\n*********************************************************\\n",
    "EULA is not accepted for the license"
   ],
   1
  ],
  0.7161028385162354
 ],
 [
  [
   [
    "DLSWP-3-PBADVALUE:%s: invalid %s %d",
    "A bad parameter value was passed to function chars1 - invalid parameter chars2 with value. This error should not cause any network problems unless it happens repeatedly."
   ],
   1
  ],
  0.6884950995445251
 ],
 [
  [
   [
    "FPD_MGMT-4-UPGRADE_EXIT:Unexpected exit of FPD image upgrade operation for %s card in %s.",
    "The sending of a message has failed. This is an informational message only."
   ],
   0
  ],
  0.5102550387382507
 ],
 [
  [
   [
    "DSPRM-5-DSP_VIC_CONFIG_NAK:Received VIC config NAK from DSP%d/%d resetting the DSP.",
    "Receieved NAK message from DSP. Re-attempt initialization."
   ],
   1
  ],
  0.6987746357917786
 ],
 [
  [
   [
    "CPPDRV-3-FATAL_INTERRUPT_OPEN:CPP%d: 0x%x Failed to access %s interrupt node - %s",
    "The software could not detect rx/tx sync lock"
   ],
   0
  ],
  0.6167721152305603
 ],
 [
  [
   [
    "ETHERNET-4-UNSUPINTFC:Interface Ethernet%d not supported by %s image",
    "The specific ethernet interface is not supported by the operating system currently running."
   ],
   1
  ],
  0.7338687181472778
 ],
 [
  [
   [
    "EPM-6-AAA:POLICY %s| EVENT %s",
    "This message indicates a download request has been sent/downloaded successfully for the specified dACL"
   ],
   1
  ],
  0.8063730001449585
 ],
 [
  [
   [
    "FNF-3-CFT_REG_FAILED:FNF fails to connect to CFT infra.",
    "An error was detected while switching a packet on the VIP"
   ],
   0
  ],
  0.7328574657440186
 ],
 [
  [
   [
    "FNF_WIRELESS-3-OPTION_RECORD_SEND_ERR:Unable to send client %e username %s to collector",
    "We are unable to send the option record for user mac address to username mapping to the configured collector. Please reconfigure the option record to the exporter.\\n"
   ],
   1
  ],
  0.6882500648498535
 ],
 [
  [
   [
    "FASTHELLO-6-FH_VERSION_MISMATCH:Local switch protocol version :%d Peer switch protocol version : %d",
    "Informational messages regarding the software versions running on the switch"
   ],
   1
  ],
  0.7030400633811951
 ],
 [
  [
   [
    "ATMPA-7-MISC1:04 0x%08x 05 0x%08x 06 0x%08x 07 0x%08x",
    "The software specified an out-of-range port on the feature board. This is a software error."
   ],
   0
  ],
  0.7148067355155945
 ],
 [
  [
   [
    "IDBMAN-3-AGGPORTMISMATCH:%s: %s%d / %d does match internal slot/port state %s%d / %d",
    "There is an internal error that caused an invalid aggregate port to be used by the software."
   ],
   1
  ],
  0.9086050391197205
 ],
 [
  [
   [
    "AAA-3-BADCURSOR:invalid cursor index %d max %d service %s protocol %s",
    "A AAA client has provided an invalid attribute cursor to AAA."
   ],
   1
  ],
  0.6071010231971741
 ],
 [
  [
   [
    "CTS-5-SXP_BINDING_CONFLICT:Binding %s<%s %s> from peer %i change to new sgt %s from peer %i",
    "SXP received conflicting sgt value from different SXP peer for the same IP prefix."
   ],
   1
  ],
  0.7150371074676514
 ],
 [
  [
   [
    "FLEXDSPRM-5-TDM_SLOT:voice channel is being shared from slot %d. Configure network-clock-participate slot %d",
    "Configure network-clock-participate slot for sharing DSPs"
   ],
   1
  ],
  0.7165070176124573
 ],
 [
  [
   [
    "IEDGE-4-TC_UNDEFINED_ACL:Traffic class ACL %s is not defined creating permit all ACL",
    "The ACL specified for classification of traffic is not configured on the ISG. Creating a permit all ACL. ACL should be configured on the ISG."
   ],
   1
  ],
  0.5832261443138123
 ],
 [
  [
   [
    "CE3-3-ERROR:%s",
    "Low Priority Interrupt received from Flow\\ Control Module in Raptor-ESI FPGA"
   ],
   0
  ],
  0.5537498593330383
 ],
 [
  [
   [
    "GBIC-4-NOREAD_VSDATA:Unable to read vendor-specific data for GBIC interface %s",
    "The GBIC was identified as a Cisco GBIC but the system was unable to read identifying vendor-specific information to verify its authenticity."
   ],
   1
  ],
  0.6077175736427307
 ],
 [
  [
   [
    "FMD-3-DELETENODEFAILED:Lookup failed for the flow of source_ip: %u dest_ip: %u source_port: %u dest_port: %u l4_protocol: %u class_id: %u vrf_table_id: %u",
    "IP Compression main database not created due to lack of memory resources."
   ],
   0
  ],
  0.7504751086235046
 ],
 [
  [
   [
    "BGP-3-NOTIFICATION_MANY:%s",
    "Notification sent to all the neighbors of the speaker. This message appears typically after doing 'clear ip bgp '."
   ],
   1
  ],
  0.7297598719596863
 ],
 [
  [
   [
    "AAAA-3-NOADMINPROC:%s",
    "The system was unable to even attempt to apply virtual appliance configuration for the given reason."
   ],
   0
  ],
  0.9289960861206055
 ],
 [
  [
   [
    "CTS-1-CTS_CRED_ACTION_NEEDED:CTS credentials are missing or inconsistent in the redundant keystore.\\n re-configure cts credentials or execute cts change-password.",
    "Cleartext traffic is passing through an interface that is configured for encryption. This traffic is accepted because the router has the CRYPTO IPSEC OPTIONAL ENABLE setting which allows such traffic."
   ],
   0
  ],
  0.7273225784301758
 ],
 [
  [
   [
    "ESCON-3-ACCESS_FAIL:LRC access Failed",
    "The strdup function reported an error."
   ],
   0
  ],
  0.7054577469825745
 ],
 [
  [
   [
    "HTTP-6-SERVER_SETUP_FAILED:\\ Server setup failed",
    "Setup of the HTTPS server to listen on the specified port number has failed."
   ],
   1
  ],
  0.7111387252807617
 ],
 [
  [
   [
    "EXFREE-4-EXMALLOCFAIL:External memory allocation of %u bytes failed from EXMEM %d",
    "The Ethernet Software Platform was unable to lock a particular piece of memory while attempting to learn a C-MAC to B-MAC mapping"
   ],
   0
  ],
  0.8097267746925354
 ],
 [
  [
   [
    "DRMI-3-IPC_ERROR:%s%s %x rc:%s",
    "ERM Framework is experiencing errors when communicating  to Line Cards using IPC"
   ],
   1
  ],
  0.7480536103248596
 ],
 [
  [
   [
    "CLUE-3-INTERNAL_SW_ERROR:%s",
    "Internal Compact Local Unit Exchange CLUE software error reported"
   ],
   1
  ],
  0.6309656500816345
 ],
 [
  [
   [
    "DIGISIGN-6-KEY_UPGRADE:%s\\n",
    "A connection was made to the SMTP server but no data can be sent."
   ],
   0
  ],
  0.7522863149642944
 ],
 [
  [
   [
    "BAP-4-WAVL:Failed to initialize AVL tree BAP not started",
    "BAP will not be operational and will not be negotiated."
   ],
   1
  ],
  0.7943964600563049
 ],
 [
  [
   [
    "CTRC-3-APPCVERB:Unexpected APPC error: opcode %04x primary code %04x secondary code %08lx",
    "An unexpected APPC error occurred. ctrc uses APPC API calls to SNASW to communicate with the remote database server. Opcode identifies the APPC API call that received the error. Primary and secondary return codes are returned by the APPC API."
   ],
   1
  ],
  0.6756117939949036
 ],
 [
  [
   [
    "GMPLS_UNSUPPORTED_RESOURCE-3-MPLS_TE_LM:Interface %s: GMPLS %s labels unsupported",
    "The indicated interface is unable to provide labels of the indicated type."
   ],
   1
  ],
  0.6792399287223816
 ],
 [
  [
   [
    "CBUS-3-CTRBADLOVE1_DUMP:Dump of MEMB follows\\n-SRB_ADDR: %04x %04x %04x %04x %04x %04x %04x %04x",
    "CFM detected an attempt to set a protocol timeout to a value that was smaller than the supported minimum and which could have led to system instability and so increased the timeout to the minimum supported value. It is possible that protocol errors will be detected as a result but system stability should not be affected."
   ],
   0
  ],
  0.6494081020355225
 ],
 [
  [
   [
    "E1T1_MODULE-3-FDLLREQFAILED:Controller %s - Failed to put the remote end in line loopback mode via FDL.",
    "Enviromental variable detected to Margin Frequencies."
   ],
   0
  ],
  0.7472522854804993
 ],
 [
  [
   [
    "IDS-4-TCP_SENDMAIL_INVALID_COMMAND:Invalid SMTP command - from %i to %i",
    "An unexpected APPC error occurred. ctrc uses APPC API calls to SNASW to communicate with the remote database server. Opcode identifies the APPC API call that received the error. Primary and secondary return codes are returned by the APPC API."
   ],
   0
  ],
  0.6038231253623962
 ],
 [
  [
   [
    "BSTUN-3-NOGRPDEF:No bstun group defined on interface %s",
    "An action was taken that requires the previous definition of a BSTUN group number."
   ],
   1
  ],
  0.7404141426086426
 ],
 [
  [
   [
    "CHOPIN-1-DWNLDFAIL:Download failed",
    "HCCP LC member will not attempt to revert back to the Working interface."
   ],
   0
  ],
  0.6703108549118042
 ],
 [
  [
   [
    "CHKPT-3-UNKNOWNMSG:Unknown message received from peer on the standby for client %d.",
    "Authentication was unsuccessful."
   ],
   0
  ],
  0.6977627277374268
 ],
 [
  [
   [
    "ATMSIG-4-CONFIG_ERROR:Configuration Error: %s %s",
    "This message indicates a configuration error in the ATM Signaling subsystem. The message will display more specific information about the problem location."
   ],
   1
  ],
  0.7929900288581848
 ],
 [
  [
   [
    "IDS-4-UDP_BOMB_SIG:Sig:4050:UDP Bomb - from %i to %i",
    "Triggers when the UDP length specified is less than the IP length specified. This malformed packet type is associated with a denial of service attempt."
   ],
   1
  ],
  0.8237655162811279
 ],
 [
  [
   [
    "ETHERCHANNEL-3-INV_PROXY_MSG:QFP ETHERCHANNEL Proxy received invalid Message ID %d",
    "An FTP client attempted to use a PORT command or the FTP server   attempted to use the response to a PASV command to trick the   firewall into opening access to a third-party host that is   different from the two hosts engaged in the FTP connection.   This message indicates that a suspicious violation was detected   while attempting to modify the security policy in the firewall.   The command is rejected and the connection is reset by the   firewall."
   ],
   0
  ],
  0.6959249377250671
 ],
 [
  [
   [
    "GLBP-3-MISCONFIG:Cannot add MAC address %e to interface %s - not supported",
    "Error during per VRF aggregate label processing"
   ],
   0
  ],
  0.5121592283248901
 ],
 [
  [
   [
    "AAA-3-SG_INTERNAL_ERROR:server group '%s': %s",
    "The counters are not encoded and transmitted properly from shim. This indicates that the operation to encode the statistics from shim has failed. This condition will result in counters out-of-sync between MQC and dsmib."
   ],
   0
  ],
  0.7504353523254395
 ],
 [
  [
   [
    "EAP-4-BADPKT:IP=%i| HOST=%s",
    "The call setup request failed"
   ],
   0
  ],
  0.7611048817634583
 ],
 [
  [
   [
    "BGP-4-AFIMPORT:%s prefixes imported to %s vrf reached the limit %d",
    "Number of prefixes imported from other address-family to a vrf reached configured limit"
   ],
   1
  ],
  0.7302224636077881
 ],
 [
  [
   [
    "AAAA-3-TIMERNOPER:AAA/ACCT/TIMER: No periodic update but timer set.",
    "This is a notification that the policy for thespecified peer is due for refresh"
   ],
   0
  ],
  0.7596353888511658
 ],
 [
  [
   [
    "CASA-4-BADMSG:Message parsing error: %s",
    "Grace Period has expired. License agent moving to garce-expired state"
   ],
   0
  ],
  0.8067686557769775
 ],
 [
  [
   [
    "C542-1-TOOBIG:%s packetsize %d too big.",
    "An internal software error occurred."
   ],
   0
  ],
  0.8198181390762329
 ],
 [
  [
   [
    "ATOM_NP_CLIENT-3-INFO:%s",
    "The environmental monitor detected a low-voltage condition."
   ],
   0
  ],
  0.6913894414901733
 ],
 [
  [
   [
    "AAAA-3-BADCOMM:Trying config command but should not be.",
    "When the startup script attempted to run it found another process had Already been started on the line"
   ],
   0
  ],
  0.708045244216919
 ]
]